{
  "app": {
    "title": "Generador de progresiones de acordes",
    "subtitle": "Crea progresiones de acordes musicalmente inteligentes — visualízalas como piano, tablaturas de guitarra o notación clásica",
    "subtitleLine2": "Imprime partituras de acordes para tocar con otros, exporta archivos MIDI para tu DAW, o exporta archivos .progression para el Akai MPC"
  },
  "chordMatcher": {
    "title": "Buscador de acordes",
    "optional": "Opcional",
    "description": "¿Has encontrado un sample con acordes geniales? Introdúcelos aquí para encontrar tonalidades y modos compatibles para tu producción.",
    "noteLabel": "Nota...",
    "qualityLabel": "Cualidad...",
    "qualities": {
      "major": "Mayor",
      "minor": "Menor",
      "dim": "Disminuido",
      "aug": "Aumentado",
      "sus2": "Sus2",
      "sus4": "Sus4",
      "7": "Dominante 7",
      "maj7": "Mayor 7",
      "m7": "Menor 7"
    },
    "addChord": "Añadir acorde",
    "clearAll": "Borrar todo",
    "compatibleLabel": "Tonalidades y modos compatibles:"
  },
  "controls": {
    "generationMode": {
      "palette": "Modo paleta de progresiones",
      "scale": "Modo escala"
    },
    "headers": {
      "palette": "Modo paleta de progresiones",
      "scale": "Modo escala"
    },
    "labels": {
      "key": "Tonalidad",
      "mode": "Modo/escala",
      "progression": "Paleta de progresiones",
      "name": "Nombre de progresión",
      "outputName": "Nombre de salida"
    }
  },
  "buttons": {
    "generate": "Generar progresiones",
    "downloadAll": "Descargar todos los archivos .progression"
  },
  "tabs": {
    "mpc": "Pads MPC",
    "keyboard": "Teclado",
    "guitar": "Guitarra",
    "staff": "Pentagrama",
    "midi": "MIDI",
    "leftHanded": "Zurdo",
    "midiOutput": "Salida MIDI:",
    "midiOutputNone": "Pitido del navegador (sin MIDI)"
  },
  "variants": {
    "Smooth": {
      "label": "Conducción de voces fluida",
      "tooltip": "Variante fluida: Maximiza las notas comunes, el movimiento por grados conjuntos y el movimiento contrario. Evalúa cientos de voicings para encontrar las transiciones más suaves entre acordes."
    },
    "Classic": {
      "label": "Conducción de voces",
      "tooltip": "Variante clásica: Optimizada para una conducción de voces fluida entre acordes. Un movimiento mínimo de notas crea progresiones naturales y fluidas."
    },
    "Jazz": {
      "label": "Voicing cerrado",
      "tooltip": "Variante jazz: Utiliza voicings cerrados con notas dentro de una octava. Crea armonías ricas y densas típicas del comping de jazz al piano."
    },
    "Modal": {
      "label": "Voicing abierto",
      "tooltip": "Variante modal: Presenta voicings abiertos con intervalos más amplios entre las notas. Produce texturas espaciosas y aireadas, ideales para la armonía modal."
    },
    "Experimental": {
      "label": "Voicing extendido",
      "tooltip": "Variante experimental: Utiliza voicings extendidos a través de múltiples octavas. Crea colores y texturas armónicas únicas y no convencionales."
    },
    "progressionClarification": "Acordes 1-{{count}} de la progresión, {{next}}-16 extrapolados. ",
    "chordDistanceHint": "Los colores de las tarjetas muestran la distancia de acordes desde la tarjeta seleccionada"
  },
  "footer": {
    "cousin": "Primo del",
    "finderLink": "MPC Chord Progression Finder",
    "producer": "Producido por Jean-Marc Liotier",
    "github": "Ver en GitHub"
  },
  "tooltips": {
    "progressionPaletteDisabled": "Las paletas de progresiones no se utilizan en el modo de exploración de escala. Se generarán todos los acordes de la escala seleccionada.",
    "progressionPaletteEnabled": "Cada paleta proporciona 16 acordes únicos: los primeros N de la progresión, los pads restantes de la armonía extendida. Los filtros específicos de género aseguran colores de acordes apropiados."
  },
  "errors": {
    "selectKey": "Por favor selecciona una tonalidad",
    "selectMode": "Por favor selecciona un modo",
    "selectProgression": "Por favor selecciona una progresión",
    "generateFailed": "Error al generar la progresión"
  },
  "messages": {
    "loading": "Cargando...",
    "generating": "Generando progresiones...",
    "complete": "Generación completada"
  },
  "chordRoles": {
    "I": "Tónica - el acorde de reposo, aporta resolución y estabilidad.",
    "II": "Supertónica - acorde de pre-dominante, a menudo conduce a V.",
    "III": "Mediante - pre-dominante débil o acorde de color, conecta I y IV/vi.",
    "IV": "Subdominante - acorde de pre-dominante, prepara el movimiento hacia V.",
    "V": "Dominante - crea una tensión que se resuelve en I.",
    "VI": "Superdominante - relativo menor, a menudo utilizado para cadencias engañosas.",
    "VII°": "Sensible - acorde disminuido, atrae fuertemente hacia I.",
    "♭II": "Segunda napolitana prestada, fuerte pre-dominante, prepara V.",
    "♭III": "Prestado del modo paralelo menor, añade un color dramático, sustituye I.",
    "♭IV": "Subdominante menor prestada, suaviza el movimiento hacia V.",
    "♭V": "Acorde prestado raro, color cromático.",
    "♭VI": "Prestado del modo paralelo menor, pre-dominante dramática, a menudo se mueve hacia V.",
    "♭VII": "Prestado del mixolidio, da un sabor rock/blues, a menudo se mueve hacia I o V.",
    "V/II": "Dominante secundaria - toniciza ii, crea un movimiento hacia ii.",
    "V/III": "Dominante secundaria - toniciza iii, raramente utilizado pero colorido.",
    "V/IV": "Dominante secundaria - toniciza IV, aclara la progresión.",
    "V/V": "Dominante secundaria - toniciza V, muy común para reforzar la cadencia.",
    "V/VI": "Dominante secundaria - toniciza vi, utilizado para cambios engañosos.",
    "VII°/II": "Acorde sensible de ii, se resuelve fuertemente en ii.",
    "VII°/III": "Acorde sensible de iii, se resuelve fuertemente en iii.",
    "VII°/IV": "Acorde sensible de IV, se resuelve fuertemente en IV.",
    "VII°/V": "Acorde sensible de V, se resuelve fuertemente en V.",
    "VII°/VI": "Acorde sensible de vi, se resuelve fuertemente en vi.",
    "SUBV7": "Sustitución tritonal - sustitución jazz para V7, crea un movimiento cromático de voces.",
    "♯I°": "Disminuido de paso - conector cromático entre acordes diatónicos.",
    "♯II°": "Disminuido de paso - conector cromático entre acordes diatónicos.",
    "sus": "Acorde suspendido - reemplaza la tercera por una segunda/cuarta, crea una suspensión antes de la resolución.",
    "add9": "Añade brillo, color soñador.",
    "6": "Color vintage, suaviza la armonía.",
    "extended": "Armonía extendida - color jazz/pop, añade profundidad.",
    "borrowed": "Acorde prestado - añade un color expresivo tomándolo del modo paralelo.",
    "default": "Color armónico - añade variedad e interés a la progresión."
  },
  "modeCategories": {
    "Common Western Tonal": "Modos tonales occidentales comunes",
    "Compact/Popular": "Compactos/populares",
    "Symmetrical/Jazz": "Simétricos/jazz",
    "Arabic Maqamat": "Maqâmât árabes",
    "Indian Ragas": "Râgas indios",
    "Exotic": "Exóticos"
  },
  "modes": {
    "Major": {
      "name": "Major",
      "description": "La gamme fondamentale de la musique occidentale. Schéma : T-T-½T-T-T-T-½T (tons et demi-tons). Crée un caractère lumineux, joyeux et résolu. Toutes les triades diatoniques (I, ii, iii, IV, V, vi, vii°) proviennent de cette gamme. Fondement de la musique classique, pop et folk pour une tonalité optimiste et stable."
    },
    "Minor": {
      "name": "Minor",
      "description": "Gamme mineure naturelle (mode Éolien). Schéma : T-½T-T-T-½T-T-T. Crée un caractère triste, introspectif, plus sombre que le majeur. Les 3e, 6e et 7e degrés abaissés la distinguent du majeur. Utilisée dans tous les genres pour des humeurs mélancoliques, émotionnelles ou sérieuses. Fondement de l'harmonie en tonalité mineure."
    },
    "Dorian": {
      "name": "Dorian",
      "description": "Gamme mineure avec 6e degré élevé. Schéma : T-½T-T-T-T-½T-T. Crée un son mineur sophistiqué - plus sombre que le majeur mais plus lumineux que le mineur naturel. L'accord de IV majeur le distingue de l'Éolien. Utilisé dans le jazz, le funk, le folk et la musique modale pour une tonalité mineure cool et sophistiquée sans tristesse lourde."
    },
    "Phrygian": {
      "name": "Phrygian",
      "description": "Gamme mineure avec 2e degré abaissé. Schéma : ½T-T-T-T-½T-T-T. Crée un caractère espagnol, moyen-oriental ou metal sombre. Le demi-ton entre la tonique et la 2e crée un son exotique distinctif. Utilisé dans le flamenco, le metal et la musique espagnole pour une atmosphère mystérieuse, sinistre ou ethnique."
    },
    "Lydian": {
      "name": "Lydian",
      "description": "Gamme majeure avec 4e degré élevé. Schéma : T-T-T-½T-T-T-½T. Crée un caractère rêveur, flottant, éthéré - encore plus lumineux que le majeur. La 4e élevée (#11) crée le son \"Lydien\" distinctif. Utilisé dans les musiques de film, le jazz et le rock progressif pour une qualité magique, surnaturelle ou flottante."
    },
    "Mixolydian": {
      "name": "Mixolydian",
      "description": "Gamme majeure avec 7e degré abaissé. Schéma : T-T-½T-T-T-½T-T. Crée un caractère bluesy, rock ou folk. L'accord de ♭VII est caractéristique. Utilisé abondamment dans le rock, le blues, le folk et le funk pour un son majeur ancré et terreux sans la tension de la sensible. Fondement de l'harmonie rock and roll."
    },
    "Locrian": {
      "name": "Locrian",
      "description": "Gamme mineure avec 2e et 5e degrés abaissés. Schéma : ½T-T-T-½T-T-T-T. Le mode le plus instable - triade tonique diminuée. Rarement utilisé pour des compositions complètes. La ♭5 crée un triton contre la fondamentale. Utilisé pour la dissonance, la tension ou des passages expérimentaux dans le metal, le jazz et la musique d'avant-garde."
    },
    "Harmonic Minor": {
      "name": "Harmonic Minor",
      "description": "Mineur naturel avec 7e degré élevé. Schéma : T-½T-T-T-½T-2T-½T. L'intervalle de seconde augmentée (entre 6 et 7) crée une tension et un drame exotiques. L'accord de V majeur permet de fortes cadences V-i. Fondement de l'harmonie mineure classique, utilisé dans le metal, le flamenco et la musique moyen-orientale pour un son mineur dramatique et classique."
    },
    "Melodic Minor": {
      "name": "Melodic Minor",
      "description": "Mineur naturel avec 6e et 7e degrés élevés (forme ascendante). Schéma : T-½T-T-T-T-T-½T. Plus doux que le mineur harmonique - pas de seconde augmentée. Utilisé dans le jazz pour l'improvisation modale et dans la musique classique pour l'ascension mélodique. Crée une tonalité mineure sophistiquée avec VI et VII majeurs permettant une conduite des voix fluide."
    },
    "Pentatonic Major": {
      "name": "Pentatonic Major",
      "description": "Gamme à cinq notes : 1-2-3-5-6 (supprime 4 et 7 de la gamme majeure). Absence de demi-tons ou tritons crée un son consonant et ouvert. Gamme universelle trouvée à travers les cultures. Utilisée dans les solos rock, les mélodies folk, les refrains pop et la musique du monde pour des mélodies chantables et accessibles qui fonctionnent sur toute harmonie."
    },
    "Pentatonic Minor": {
      "name": "Pentatonic Minor",
      "description": "Gamme à cinq notes : 1-♭3-4-5-♭7 (supprime 2 et 6 du mineur naturel). Le fondement des solos blues, rock et blues-rock. Absence de demi-tons crée un caractère fluide et coulant. Gamme mineure universelle utilisée à travers les cultures. Essentielle pour les solos de guitare, l'improvisation vocale et les mélodies mineures accessibles."
    },
    "Blues": {
      "name": "Blues",
      "description": "Gamme à six notes : 1-♭3-4-♭5-5-♭7. Ajoute la \"blue note\" (♭5) à la pentatonique mineure. La ♭5 crée le \"bend\" blues caractéristique et la tension. Fondement de l'improvisation blues, rock, jazz et R&B. La ♭3 ambiguë sur des accords majeurs crée la dissonance bluesy. Gamme la plus importante dans la musique populaire américaine."
    },
    "Whole Tone": {
      "name": "Whole Tone",
      "description": "Gamme à six notes construite entièrement de tons entiers : T-T-T-T-T-T. Parfaitement symétrique - pas de tonique ni de résolution. Crée un caractère rêveur, flottant, surréaliste. Pas de quintes ou quartes justes, seulement des accords augmentés. Utilisée par Debussy et dans le jazz pour une atmosphère ambiguë, impressionniste et surnaturelle. Définit le surréalisme musical."
    },
    "Diminished (W-H)": {
      "name": "Diminished (W-H)",
      "description": "Gamme octatonique à huit notes alternant tons et demi-tons : T-½T-T-½T-T-½T-T-½T. Parfaitement symétrique, divise l'octave en quatre parties égales. Utilisée sur les accords de dominante 7 dans le jazz. Crée un caractère tendu, instable et chromatique. Essentielle au bebop pour les sons de dominante altérée et le jeu outside."
    },
    "Diminished (H-W)": {
      "name": "Diminished (H-W)",
      "description": "Gamme octatonique à huit notes alternant demi-tons et tons : ½T-T-½T-T-½T-T-½T-T. Schéma inversé du diminué T-½T. Utilisée sur les accords diminués 7. La structure symétrique crée un caractère tendu et non résolu. Essentielle au jazz pour l'improvisation sur accords diminués et la conduite chromatique des voix en composition."
    },
    "Augmented": {
      "name": "Augmented",
      "description": "Gamme hexatonique à six notes construite à partir de triades augmentées avec notes de passage : 1-♭3-3-5-♯5-7. Symétrique, divise l'octave en trois tierces majeures égales. Pas de quintes justes. Crée un caractère ambigu, flottant, moderniste. Utilisée dans la musique classique du 20e siècle et le jazz pour des contextes d'accords augmentés et des structures harmoniques symétriques."
    },
    "Maqam Hijaz": {
      "name": "Maqam Hijaz",
      "description": "Maqâm arabe approximé en tempérament égal comme Phrygien Dominant : 1-♭2-3-4-5-♭6-♭7. La seconde augmentée entre ♭2 et 3 crée le son moyen-oriental caractéristique. Combine le ♭2 phrygien avec la tierce majeure. Utilisé dans la musique arabe, turque et klezmer pour un caractère exotique, spirituel et oriental. Évoque la prière et le mysticisme."
    },
    "Maqam Bayati": {
      "name": "Maqam Bayati",
      "description": "Maqâm arabe approximé comme Phrygien : 1-♭2-♭3-4-5-♭6-♭7. Similaire au mode Phrygien mais avec des inflexions microtonales dans l'interprétation traditionnelle. Crée un caractère mélancolique et contemplatif moyen-oriental. L'un des maqâmât arabes les plus courants. Utilisé dans le monde arabe pour des mélodies émotionnelles et introspectives."
    },
    "Maqam Rast": {
      "name": "Maqam Rast",
      "description": "Maqâm arabe approximé comme majeur : 1-2-3-4-5-6-7, mais avec des variations microtonales de quart de ton traditionnellement. Considéré comme maqâm \"neutre\" ou \"reposant\". Caractère lumineux et stable similaire au majeur occidental mais avec de subtiles inflexions orientales. Maqâm fondamental dans la théorie musicale arabe. Utilisé pour des mélodies joyeuses, festives ou dignes."
    },
    "Maqam Saba": {
      "name": "Maqam Saba",
      "description": "Maqâm arabe au caractère distinctivement triste et nostalgique. Approximé comme 1-♭2-♭3-♭4-♭5-♭6-♭7. Plusieurs degrés abaissés créent une atmosphère sombre et mélancolique. La ♭4 est particulièrement caractéristique. Utilisé pour des expressions profondément émotionnelles et tristes dans la musique arabe. Crée une tristesse et un désir profonds."
    },
    "Maqam Kurd": {
      "name": "Maqam Kurd",
      "description": "Maqâm arabe identique au mode Phrygien : 1-♭2-♭3-4-5-♭6-♭7. L'un des maqâmât de type mineur les plus importants. Crée un caractère mélancolique mais digne. Le nom kurde reflète les origines historiques. Utilisé dans tout le Moyen-Orient pour une musique sérieuse et contemplative. Qualité émotionnelle similaire au mineur naturel occidental mais avec la couleur phrygienne ♭2."
    },
    "Bhairav": {
      "name": "Bhairav",
      "description": "Râga matinal, identique à la gamme Double Harmonique : 1-♭2-3-4-5-♭6-7. Deux secondes augmentées (♭2-3 et ♭6-7) créent une tension dramatique distinctive. Associé à Shiva. Caractère sérieux et dévotionnel. Utilisé dans la musique classique nord-indienne pour la méditation matinale et la contemplation spirituelle. Crée une atmosphère exotique, intense et puissante."
    },
    "Kafi": {
      "name": "Kafi",
      "description": "Râga d'après-midi/soirée, identique au mode Dorien : 1-2-♭3-4-5-6-♭7. L'une des dix gammes mères (thaat) dans la musique hindoustanie. Crée un caractère paisible et romantique. La 6e majeure le distingue du mineur naturel. Utilisé dans la musique dévotionnelle et classique légère pour des humeurs douces, sucrées et contemplatives. Similaire au Dorien occidental mais avec ornementation indienne."
    },
    "Yaman": {
      "name": "Yaman",
      "description": "Râga du soir, identique au mode Lydien : 1-2-3-♯4-5-6-7. L'un des râgas les plus populaires dans la musique classique hindoustanie. Crée un caractère paisible, romantique et dévotionnel. La ♯4 (tivra ma) est caractéristique. Associé à la création et au printemps. Utilisé pour des expressions sereines, belles et élevantes. Évoque la tranquillité et la beauté spirituelle."
    },
    "Bhairavi": {
      "name": "Bhairavi",
      "description": "Râga matinal mais joué à tout moment, identique au Phrygien : 1-♭2-♭3-4-5-♭6-♭7. L'une des dix gammes mères. Crée un caractère dévotionnel et sérieux avec flexibilité pour l'ornementation. Associé à la déesse Parvati. Utilisé pour les prières matinales et les performances d'adieu. Râga le plus flexible, permet des variations chromatiques. Évoque la dévotion et le pathos."
    },
    "Todi": {
      "name": "Todi",
      "description": "Râga de midi avec gamme unique : 1-♭2-♭3-♯4-5-♭6-7. Combine le ♭2 phrygien, la 4e élevée (lydienne) et la 7e majeure. Crée un caractère intense, nostalgique et passionné. Considéré comme l'un des râgas les plus sérieux et dévotionnels. Associé à l'émotion profonde et au désir. Les intervalles augmentés distinctifs créent une atmosphère hantée et spirituelle."
    },
    "Double Harmonic": {
      "name": "Double Harmonic",
      "description": "Gamme exotique avec deux secondes augmentées : 1-♭2-3-4-5-♭6-7 (identique à Bhairav). \"Double\" fait référence aux secondes augmentées entre ♭2-3 et ♭6-7. Crée un caractère dramatique moyen-oriental/indien. Utilisée dans le metal, le rock progressif et la fusion world pour une saveur exotique maximale et de la tension. Son extrêmement distinctif et reconnaissable."
    },
    "Hungarian Minor": {
      "name": "Hungarian Minor",
      "description": "Mineur harmonique avec 4e élevée : 1-2-♭3-♯4-5-♭6-7. Trois secondes augmentées créent un caractère gitan exotique. Plus chromatique que le mineur harmonique. Utilisée dans la musique folklorique hongroise, le jazz manouche, la musique classique (Liszt) et le metal. Crée une atmosphère passionnée, dramatique et est-européenne. Gamme signature du jazz style Django Reinhardt."
    },
    "Neapolitan Major": {
      "name": "Neapolitan Major",
      "description": "Gamme majeure avec 2e abaissée : 1-♭2-3-4-5-6-7. Crée une gamme lumineuse avec une torsion sombre et chromatique du ♭2. Utilisée dans la musique classique (notamment la cadence napolitaine IV6 de ♭II). Le ♭2 crée une tension contre la tonique tout en maintenant le caractère majeur. Utilisée pour une couleur chromatique sophistiquée dans la musique classique et de film."
    },
    "Neapolitan Minor": {
      "name": "Neapolitan Minor",
      "description": "Mineur harmonique avec 2e abaissée : 1-♭2-♭3-4-5-♭6-7. Combine le drame du mineur harmonique avec le ♭2 phrygien. Deux secondes augmentées créent une tension extrême. Caractère très sombre et exotique. Utilisée dans la musique classique pour des passages dramatiques et sinistres. Plus intense et chromatique que le mineur harmonique. Crée une atmosphère inquiétante et menaçante."
    },
    "Enigmatic": {
      "name": "Enigmatic",
      "description": "Gamme synthétique rare : 1-♭2-3-♯4-♯5-♯6-7. Plusieurs degrés élevés créent une ambiguïté à la manière de la gamme par tons avec tension chromatique. Popularisée par Verdi. Extrêmement instable - difficile d'établir une tonalité. Utilisée pour des passages mystérieux, surréels et non résolus. L'une des gammes traditionnelles les plus dissonantes et ambiguës. Crée un caractère vraiment énigmatique."
    },
    "Phrygian Dominant": {
      "name": "Phrygian Dominant",
      "description": "Cinquième mode du mineur harmonique : 1-♭2-3-4-5-♭6-♭7 (identique à Maqam Hijaz). Combine le ♭2 phrygien avec la tierce majeure. La seconde augmentée entre ♭2 et 3 crée le son espagnol/moyen-oriental distinctif. Fondement de la musique flamenco. Utilisé dans le metal, le rock progressif et la world music pour une saveur exotique et dramatique. Son instantanément reconnaissable."
    },
    "Persian": {
      "name": "Persian",
      "description": "Gamme exotique approximant la musique persane : 1-♭2-3-4-♭5-♭6-7. Combine le ♭2 phrygien, la tierce majeure, la quinte diminuée et la 7e majeure. Plusieurs intervalles augmentés et diminués créent un caractère complexe et tendu. Utilisée pour une saveur moyen-orientale avec chromatisme supplémentaire. Crée une atmosphère mystérieuse, ancienne et exotique au-delà du Phrygien Dominant standard."
    },
    "Hirajoshi": {
      "name": "Hirajoshi",
      "description": "Gamme pentatonique japonaise : 1-2-♭3-5-♭6. Gamme à cinq notes sans quinte juste. Crée un caractère distinctement japonais - ni purement majeur ni mineur. Utilisée dans la musique traditionnelle japonaise et les compositions modernes recherchant une saveur japonaise. Les intervalles uniques créent une atmosphère paisible, contemplative et exotique. Son signature du koto et shamisen."
    },
    "Insen": {
      "name": "Insen",
      "description": "Gamme pentatonique japonaise : 1-♭2-4-5-♭7. Caractère mineur sombre avec ♭2 phrygien. Crée une atmosphère japonaise mélancolique. Utilisée dans la musique traditionnelle japonaise et les bandes sonores modernes. Le ♭2 donne un côté exotique à la structure pentatonique mineure. Évoque le Japon ancien, la méditation et l'introspection. Populaire dans la musique de jeux vidéo et d'anime."
    },
    "Kumoi": {
      "name": "Kumoi",
      "description": "Gamme pentatonique japonaise : 1-2-♭3-5-6. Pentatonique mineure avec 6e naturelle. Plus lumineuse que la pentatonique mineure standard, plus sombre que la pentatonique majeure. Crée un caractère japonais doux. Utilisée dans la musique traditionnelle et les chansons folkloriques. La 6e majeure apporte un éclat dans un contexte mineur. Évoque la beauté naturelle et les paysages japonais pastoraux."
    },
    "Egyptian Pentatonic": {
      "name": "Egyptian Pentatonic",
      "description": "Pentatonique suspendue ancienne : 1-2-4-5-♭7. Pas de tierce, crée un caractère suspendu et ambigu. Utilisée dans la musique égyptienne antique (reconstruction théorique) et la musique folklorique moyen-orientale. Similaire à la pentatonique mineure mais avec une 2e majeure au lieu de ♭3. Crée une atmosphère neutre, ancienne et intemporelle. Populaire pour la world music et la fusion ethnique."
    }
  },
  "progressionCategories": {
    "Pop/Rock": "Pop/Rock",
    "Blues/Soul": "Blues/Soul",
    "Jazz/Functional": "Jazz/Funcional",
    "Classical/Modal": "Clásico/Modal",
    "Electronic/Modern": "Electrónico/Moderno",
    "R&B/Neo-Soul": "R&B/Neo-Soul",
    "Gospel/Worship": "Gospel/Adoración",
    "Hip-Hop/Trap": "Hip-Hop/Trap",
    "Latin/Bossa": "Latin/Bossa",
    "Film/Cinematic": "Cine/Cinematográfico",
    "Folk/Singer-Songwriter": "Folk/Cantautor",
    "Metal/Rock": "Metal/Rock",
    "Trance/Psytrance/Goa": "Trance/Psytrance/Goa",
    "Jungle/Drum'n'Bass": "Jungle/Drum'n'Bass",
    "Italo-Disco/House": "Italo-Disco/House",
    "Synthwave/Retrowave": "Synthwave/Retrowave",
    "African Dance": "Danza africana",
    "UK Bass": "UK Bass",
    "Reggae/Dub": "Reggae/Dub",
    "Acid/EBM": "Acid/EBM"
  },
  "progressions": {
    "Pop/Rock": {
      "I—V—vi—IV": {
        "name": "I—V—vi—IV",
        "nickname": "Axis of Awesome",
        "description": "La progresión más popular en el pop moderno. Tónica a dominante crea movimiento hacia adelante, resolución deceptiva a vi añade emoción, IV proporciona retorno suave. Usada en cientos de éxitos desde \"Let It Be\" hasta \"Don't Stop Believin'.\""
      },
      "I—IV—V—I": {
        "name": "I—IV—V—I",
        "nickname": "Classic Rock",
        "description": "La base del rock and roll. Se mueve de tónica a través de subdominante a dominante, creando tensión y resolución satisfactorias. La columna vertebral del blues, country y rock temprano desde Chuck Berry hasta los Beatles."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Pop Punk",
        "description": "Comienza en menor relativa para impacto emocional inmediato, luego cicla a través de subdominante, tónica y dominante. Crea sensación de himno, para cantar juntos. Popularizada por bandas como Blink-182 y Green Day."
      },
      "I—vi—IV—V": {
        "name": "I—vi—IV—V",
        "nickname": "50s Doo-Wop",
        "description": "Los cambios clásicos \"doo-wop\" de los grupos vocales de los años 1950. Tónica a menor relativa crea melancolía suave, subdominante y dominante completan el círculo. Piensa en \"Stand By Me\" o \"Blue Moon.\""
      },
      "I—V—vi—iii—IV": {
        "name": "I—V—vi—iii—IV",
        "nickname": "Canon Progression",
        "description": "Secuencia del Canon de Pachelbel extendida. Desciende a través de la escala, creando impulso hacia adelante inevitable. Usada en \"Basket Case,\" \"Hook,\" innumerables baladas. El acorde iii añade complejidad romántica."
      },
      "IV—I—V—vi": {
        "name": "IV—I—V—vi",
        "nickname": "Despacito",
        "description": "Comienza con subdominante para elevación inmediata, resuelve a tónica, luego se mueve a través de dominante a menor relativa. Crea sensación circular, hipnótica perfecta para pop latino y grooves de reggaeton."
      },
      "vi—V—IV—V": {
        "name": "vi—V—IV—V",
        "nickname": "Grenade",
        "description": "Tónica menor a dominante crea tensión dramática, subdominante ofrece breve respiro antes de que dominante construya de nuevo. Perfecto para power ballads y clímax emocionales como \"Grenade\" de Bruno Mars."
      },
      "I—III—IV—iv": {
        "name": "I—III—IV—iv",
        "nickname": "Creep",
        "description": "Hecho famoso por Radiohead. Tónica mayor a III mayor es inesperado, IV es familiar, luego iv (prestado de menor) añade melancolía inquietante. El movimiento cromático del bajo crea sensación descendente distintiva."
      },
      "I—V—♭VII—IV": {
        "name": "I—V—♭VII—IV",
        "nickname": "Sweet Home",
        "description": "El sabor mixolidio del ♭VII prestado crea sonido rock sureño bluesy. La subdominante mayor después de la séptima bemol proporciona elevación satisfactoria. Icónico en \"Sweet Home Alabama\" e himnos del rock clásico."
      },
      "I—♭VII—IV—I": {
        "name": "I—♭VII—IV—I",
        "nickname": "Mixolydian Vamp",
        "description": "Progresión mixolidia circular. El ♭VII prestado del menor paralelo añade borde rock, IV a I proporciona cadencia perfecta tradicional. Crea sensación rock modal impulsora sin el acorde dominante V."
      }
    },
    "Blues/Soul": {
      "I—I—I—I—IV—IV—I—I—V—IV—I—V": {
        "name": "I—I—I—I—IV—IV—I—I—V—IV—I—V",
        "nickname": "12-Bar Blues",
        "description": "La base del blues, rock y jazz. Cuatro compases de tónica establecen el hogar, el acorde IV crea tensión, el retorno a I proporciona alivio, V-IV crea el \"turnaround\" hacia I. La progresión más importante en la música americana."
      },
      "I—vi—ii—V": {
        "name": "I—vi—ii—V",
        "nickname": "Turnaround",
        "description": "Turnaround jazz clásico. Desciende de I a través de menor relativa (vi), luego ii-V crea fuerte atracción hacia I. Usado al final del blues de 12 compases y en innumerables standards de jazz para volver suavemente al principio."
      },
      "ii—V—I—VI": {
        "name": "ii—V—I—VI",
        "nickname": "Rhythm Changes A",
        "description": "De \"I Got Rhythm\" de Gershwin, los cambios de acordes más comunes en jazz después del blues. El ii-V-I es la resolución más fuerte en armonía funcional, VI crea movimiento cromático y conduce al siguiente ciclo."
      },
      "I—VI—ii—V": {
        "name": "I—VI—ii—V",
        "nickname": "I Got Rhythm",
        "description": "Otra variación de los rhythm changes. I a VI (acorde mayor en el sexto grado de la escala) crea movimiento cromático del bajo, luego ii-V prepara el retorno a I. El acorde VI a menudo se toca como V7/ii, creando movimiento hacia adelante aún más fuerte."
      },
      "i—♭III—♭VII—IV": {
        "name": "i—♭III—♭VII—IV",
        "nickname": "Dorian Vamp",
        "description": "Blues modal en modo dórico. Tónica menor a ♭III mayor crea impulso esperanzador, ♭VII añade sabor bluesy, IV (mayor en dórico) aporta brillo. Crea sonido blues menor sofisticado popularizado por Miles Davis y jazz modal."
      },
      "i—IV—i—V": {
        "name": "i—IV—i—V",
        "nickname": "Minor Blues",
        "description": "La progresión blues menor. Tónica menor a IV mayor crea cambio dramático, retorno a i establece tonalidad menor, V mayor crea tensión que implora resolución. Más dramática y melancólica que el blues mayor estándar."
      }
    },
    "Jazz/Functional": {
      "ii—V—I": {
        "name": "ii—V—I",
        "nickname": "2-5-1",
        "description": "La progresión más fundamental en jazz. El ii (supertónica) prepara el V (dominante), que resuelve fuertemente a I (tónica). Este movimiento de círculo de quintas es el bloque de construcción de la armonía funcional y aparece en casi todos los standards de jazz."
      },
      "ii—V—I—vi": {
        "name": "ii—V—I—vi",
        "nickname": "Jazz Standard",
        "description": "Cadencia ii-V-I extendida con resolución deceptiva. Después del fuerte ii-V-I, el acorde vi sorprende al oído en lugar de quedarse en I, creando momentum continuo hacia adelante. Perfecto para bucles en improvisaciones y standards de jazz."
      },
      "iii—vi—ii—V": {
        "name": "iii—vi—ii—V",
        "nickname": "Circle Progression",
        "description": "Círculo de quintas descendente: iii a vi a ii a V. Cada acorde está una quinta por debajo del anterior, creando atracción gravitacional inevitable hacia la tónica. Demuestra armonía funcional pura en acción - usada abundantemente en bebop y hard bop."
      },
      "IVM7—V7—iii7—vi": {
        "name": "IVM7—V7—iii7—vi",
        "nickname": "Fly Me To The Moon",
        "description": "Del standard de jazz de Bart Howard. IV-V crea movimiento fuerte, iii-vi continúa descendiendo por terceras (cascada plagal). Los ricos voicings maj7 y dom7 crean sonido jazz sofisticado y romántico perfecto para baladas."
      },
      "IM7—ii7—iii7—IVM7": {
        "name": "IM7—ii7—iii7—IVM7",
        "nickname": "Ascending Jazz",
        "description": "Progresión ascendente por grados a través de acordes de 7ª diatónicos. Crea movimiento suave y elevador. Evita resoluciones funcionales fuertes, pintando en su lugar con color y textura. Común en jazz modal y composiciones de jazz contemporáneo."
      },
      "vi—ii—V—I": {
        "name": "vi—ii—V—I",
        "nickname": "Minor Turnaround",
        "description": "Comienza en menor relativa (vi) para inicio emocional más oscuro, luego cicla a través de ii-V-I para resolver a tónica mayor. El contraste entre inicio menor y resolución mayor crea arco emocional satisfactorio común en baladas de jazz."
      },
      "I—vi—IV—♯iv°—V": {
        "name": "I—vi—IV—♯iv°—V",
        "nickname": "Chromatic Turnaround",
        "description": "Turnaround clásico con acorde disminuido de paso. El ♯iv° (cuatro aumentado disminuido) crea línea de bajo cromática (I-vi-IV-♯iv°-V), añadiendo sofisticación armónica. El acorde disminuido funciona como dominante de la dominante, fortaleciendo resolución a V."
      },
      "iv—♭VII—I": {
        "name": "iv—♭VII—I",
        "nickname": "Backdoor",
        "description": "La \"progresión backdoor\" - se acerca a la tónica desde ♭VII en lugar de V. El iv prestado del menor paralelo añade color, ♭VII crea resolución de tono entero a I (movimiento plagal). Proporciona alivio del constante ii-V-I, añade frescura inesperada a la armonía jazz."
      },
      "I—♯I°—ii—♯II°": {
        "name": "I—♯I°—ii—♯II°",
        "nickname": "Chromatic Walk",
        "description": "Línea de bajo ascendente cromática usando acordes disminuidos de paso. Cada acorde disminuido conecta acordes diatónicos separados por tono entero. Crea conducción de voces suave y sonido sofisticado usado en intros e interludios de jazz."
      },
      "IM7—♭IIIM7—♭VIM7—♭II7": {
        "name": "IM7—♭IIIM7—♭VIM7—♭II7",
        "nickname": "Giant Steps",
        "description": "Los cambios revolucionarios \"Giant Steps\" de John Coltrane. Se mueve a través de tres centros tonales divididos en terceras mayores (I, ♭III, ♭VI). El ♭II7 es sustitución tritónica. Crea movimiento armónico máximo, momento definitorio en la evolución del jazz."
      }
    },
    "Classical/Modal": {
      "I—IV—vii°—iii—vi—ii—V—I": {
        "name": "I—IV—vii°—iii—vi—ii—V—I",
        "nickname": "Circle of Fifths",
        "description": "Progresión completa del círculo de quintas. Cada fundamental de acorde desciende por quinta justa (o asciende por cuarta justa), demostrando la atracción gravitacional de la armonía funcional. Progresión pedagógica fundamental mostrando cómo todos los acordes diatónicos se relacionan."
      },
      "I—V—vi—iii—IV—I—IV—V": {
        "name": "I—V—vi—iii—IV—I—IV—V",
        "nickname": "Pachelbel Canon",
        "description": "La famosa progresión del Canon en Re de Johann Pachelbel. La línea de bajo descendente por grados crea conducción de voces elegante. La secuencia se convirtió en cliché por sobreuso pero permanece pedagógicamente valiosa para enseñar contrapunto barroco y técnica de bajo ostinato."
      },
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Andalusian",
        "description": "La \"cadencia andaluza\" del modo frigio. El tetracordio descendente (patrón de cuatro notas) crea carácter trágico español. Tónica menor a ♭VII y ♭VI prestados, terminando en V mayor. Usada en flamenco, música clásica y de cine para sabor mediterráneo."
      },
      "i—♭VII—i—V": {
        "name": "i—♭VII—i—V",
        "nickname": "Passamezzo Antico",
        "description": "Progresión de danza renacentista, \"passamezzo antiguo\". Tónica menor a ♭VII prestado crea ambigüedad modal, retorno a i confirma menor, V mayor proporciona tensión. Ejemplo temprano de armonía menor i-V anterior al período de práctica común."
      },
      "I—V—I—IV": {
        "name": "I—V—I—IV",
        "nickname": "Passamezzo Moderno",
        "description": "\"Passamezzo moderno\" renacentista - la versión mayor. Aserción tónica-dominante, retorno a tónica, luego subdominante. Progresión de danza en modo mayor simple pero efectiva. Muestra evolución del pensamiento modal a tonal en el período barroco temprano."
      },
      "iv—♭VII—♭III—♭VI": {
        "name": "iv—♭VII—♭III—♭VI",
        "nickname": "Plagal Cascade",
        "description": "Movimiento plagal (subdominante) descendente a través de acordes prestados. Sin dominante presente - todas resoluciones \"suaves\". Crea atmósfera modal oscura evitando cadencias funcionales V-I. Popular en bandas sonoras de cine y rock progresivo para calidad ambigua y flotante."
      },
      "i—iv—♭VII—♭III": {
        "name": "i—iv—♭VII—♭III",
        "nickname": "Natural Minor",
        "description": "Progresión menor natural pura (modo eólico) usando acordes diatónicos. Tónica y subdominante menores establecen sensación menor, ♭VII y ♭III son característicos de menor natural versus menor armónica. Crea atmósfera melancólica y modal sin resolución de sensible."
      }
    },
    "Electronic/Modern": {
      "i—♭VI—♭III—♭VII": {
        "name": "i—♭VI—♭III—♭VII",
        "nickname": "EDM Drop",
        "description": "La progresión del \"drop\" en EDM moderno. Tónica menor a ♭VI prestado crea elevación inmediata, ♭III añade color esperanzador, ♭VII proporciona energía mixolidia impulsora. Evita la dominante V para bucle hipnótico no funcional. Perfecto para build-ups y drops de bajo."
      },
      "i—♭VII—♭VI—♭VII": {
        "name": "i—♭VII—♭VI—♭VII",
        "nickname": "Dark House",
        "description": "Progresión dark minor house. ♭VII y ♭VI prestados del mayor paralelo crean ambigüedad modal, evitando armonía menor tradicional. El ♭VII oscila, creando tensión sin resolución. Usada en tech house y dark progressive house para atmósfera amenazante."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Pop Loop",
        "description": "Optimizada para bucle electrónico. Comienza en menor relativa para emoción inmediata, cicla a través de cambios pop familiares pero termina en V en lugar de IV, creando atracción más fuerte de vuelta al principio. Perfecto para bucles de 4 compases sin costura en pop electrónico y future bass."
      },
      "I—V—vi—IV—I—V—iii—IV": {
        "name": "I—V—vi—IV—I—V—iii—IV",
        "nickname": "Extended Pop",
        "description": "Progresión pop extendida de ocho compases. Primeros cuatro compases son el clásico \"Axis of Awesome\" I-V-vi-IV, segundos cuatro compases sustituyen iii por vi, creando variación manteniendo familiaridad. Permite builds más largos y arreglos más complejos en producción pop electrónica."
      },
      "i—♭III—♭VII—i": {
        "name": "i—♭III—♭VII—i",
        "nickname": "Modal Interchange",
        "description": "Demuestra concepto de intercambio modal. Todos acordes prestados del mayor paralelo (♭III, ♭VII) mezclados con i menor natural. Crea tonalidad moderna y ambigua evitando resolución V-i tradicional. Piedra angular de la armonía de música electrónica contemporánea, desde synthwave hasta future bass."
      },
      "I—♭III—IV—♭VI": {
        "name": "I—♭III—IV—♭VI",
        "nickname": "Chromatic Mediant",
        "description": "Explora relaciones de mediante cromática. I a ♭III es cambio dramático (raíces separadas por tercera mayor, no en tonalidad), IV es familiar, ♭VI es otra mediante cromática. Crea movimiento armónico cinemático e inesperado. Usada en progressive house y melodic dubstep para impacto emocional."
      },
      "i—iv—v": {
        "name": "i—iv—v",
        "nickname": "Techno Minimal",
        "description": "Paleta escasa y mecánica. Tríadas menores y voicings cuartales para bucles hipnóticos."
      },
      "I—IV—V": {
        "name": "I—IV—V",
        "nickname": "Deep House",
        "description": "Paleta cálida y jazzística. Acordes de 7ª ricos para vibes deep house soulful y groovy."
      },
      "IM7—IVM7—VM7": {
        "name": "IM7—IVM7—VM7",
        "nickname": "Ambient Wash",
        "description": "Paleta abierta y flotante. 7as mayores/menores y voicings cuartales para paisajes sonoros etéreos."
      }
    },
    "R&B/Neo-Soul": {
      "ii—V—IM7—vi": {
        "name": "ii—V—IM7—vi",
        "nickname": "Neo-Soul Standard",
        "description": "Cambios neo-soul influenciados por jazz. Abre con ii-V prestado del jazz, resuelve a IM7 (no I simple) para color sofisticado, acorde deceptivo vi añade melancolía. Voicings ricos de acordes de 7ª esenciales. Define el sonido de D'Angelo, Erykah Badu y R&B moderno."
      },
      "IM7—iii7—vi7—ii7": {
        "name": "IM7—iii7—vi7—ii7",
        "nickname": "Smooth R&B",
        "description": "Acordes de 7ª diatónicos descendentes crean sonido exuberante y sofisticado. Todas 7as mayores y menores, sin tensión dominante - calidad suave y flotante. Desciende por terceras luego cuartas, creando movimiento suave hacia adelante. Perfecto para slow jams y baladas R&B contemporáneas."
      },
      "I—IV—ii—V": {
        "name": "I—IV—ii—V",
        "nickname": "Classic R&B",
        "description": "Combina simplicidad pop con sofisticación jazz. I-IV es movimiento plagal familiar, ii-V es cadencia jazz clásica. El acorde ii transforma el familiar I-IV-V en algo más refinado. Fundamento de Motown, Stax y soul clásico de los 60s y 70s."
      },
      "vi—ii—iii—IV": {
        "name": "vi—ii—iii—IV",
        "nickname": "Emotional Ballad",
        "description": "Comienza en menor relativa para vulnerabilidad inmediata, asciende a través de ii y iii (aumentando tensión), resuelve a IV (subdominante). Evita acordes obvios I y V, creando arco emocional sofisticado. Común en baladas R&B modernas y neo-soul, permite libertad melódica."
      },
      "IM7—V7/IV—IVM7—iv": {
        "name": "IM7—V7/IV—IVM7—iv",
        "nickname": "Chromatic Soul",
        "description": "Armonía cromática avanzada. V7/IV es dominante secundaria (dominante de IV), creando tonicización temporal. IV mayor a iv menor es cambio cromático prestado del menor paralelo. Crea conducción de voces sofisticada y color armónico característico de Stevie Wonder y neo-soul moderno."
      },
      "i—iv—♭VII—♭VI": {
        "name": "i—iv—♭VII—♭VI",
        "nickname": "Minor Soul",
        "description": "Progresión R&B en modo menor. i-iv menor natural establece fundación oscura, ♭VII y ♭VI prestados de dórico/eólico crean ambigüedad modal. Movimiento plagal descendente evita resolución dominante. Usado en R&B contemporáneo para atmósfera más oscura y melancólica."
      },
      "I—♯iv°—ii—V": {
        "name": "I—♯iv°—ii—V",
        "nickname": "Gospel Soul",
        "description": "Acorde cromático de paso influenciado por gospel. El ♯iv° (cuatro aumentado disminuido) crea línea de bajo cromática suave conectando I a ii, luego cadencia clásica ii-V. El acorde disminuido funciona como dominante de la dominante, añadiendo sofisticación armónica prestada de la tradición de iglesia negra."
      }
    },
    "Gospel/Worship": {
      "I—V/ii—ii—V": {
        "name": "I—V/ii—ii—V",
        "nickname": "Gospel Turnaround",
        "description": "Retournement gospel classique avec dominante secondaire. V/ii (dominante de ii) crée une approche chromatique de l'accord ii, puis cadence traditionnelle ii-V vers I. La dominante secondaire ajoute sophistication harmonique et momentum vers l'avant caractéristiques de la musique d'église noire et du gospel traditionnel."
      },
      "IV—V—iii—vi": {
        "name": "IV—V—iii—vi",
        "nickname": "Praise Progression",
        "description": "Progression de louange et adoration élevante. Commence sur IV (sous-dominante) pour un élan immédiat plutôt que I, V ajoute de l'énergie, descend par iii vers vi créant une résolution douce. Évite d'arriver sur I, gardant l'énergie en mouvement vers l'avant. Courant dans les refrains de louange et adoration contemporains."
      },
      "I—IV—V/vi—vi": {
        "name": "I—IV—V/vi—vi",
        "nickname": "Contemporary Worship",
        "description": "Progression d'adoration moderne avec dominante secondaire. Ouverture familière I-IV, V/vi (dominante de vi) approche chromatiquement le mineur relatif, créant une conduite des voix douce. L'arrivée sur vi ajoute introspection et émotion. Définit la musique chrétienne contemporaine de Hillsong à Bethel."
      },
      "ii—V—I—IV": {
        "name": "ii—V—I—IV",
        "nickname": "Church Cadence",
        "description": "Combine l'harmonie jazz et hymne. S'ouvre avec une forte cadence ii-V-I empruntée au jazz (courant dans le gospel), ajoute le mouvement plagal IV-I de l'hymnodie traditionnelle. Les deux types de cadence créent une double résolution satisfaisante. Fondamental au piano gospel et au jeu d'orgue Hammond."
      },
      "I—V/V—V—vi—IV": {
        "name": "I—V/V—V—vi—IV",
        "nickname": "Gospel Rock",
        "description": "Progression fusion gospel-rock. V/V (dominante de la dominante) crée une intensité chromatique approchant V, puis vi trompeur ajoute de l'émotion, IV complète le mouvement plagal. Combine le chromatisme gospel avec l'énergie rock. Utilisé dans le rock chrétien contemporain et la pop influencée par le gospel."
      },
      "IV—I—V—vi—IV—♭VII": {
        "name": "IV—I—V—vi—IV—♭VII",
        "nickname": "Extended Worship",
        "description": "Progression d'adoration étendue de six mesures. S'ouvre sur la sous-dominante pour l'élan, cycle à travers des changements familiers, ajoute ♭VII emprunté à la fin pour couleur modale et saveur mixolydienne. L'extension permet des montées mélodiques et dynamiques plus longues courantes dans la production d'adoration moderne et les contextes live."
      }
    },
    "Hip-Hop/Trap": {
      "i—♭VI—♭VII": {
        "name": "i—♭VI—♭VII",
        "nickname": "Trap Minor",
        "description": "Progression trap moderne essentielle. Tonique mineure avec ♭VI et ♭VII empruntés crée une atmosphère modale sombre. Boucle courte de trois accords parfaite pour les lignes de basse 808 et les roulements de charleston. Évite les cadences traditionnelles pour un son trap hypnotique et menaçant de Metro Boomin à Southside."
      },
      "i—♭III—♭VI—♭VII": {
        "name": "i—♭III—♭VI—♭VII",
        "nickname": "Dark Trap",
        "description": "Progression trap sombre étendue. Tous les accords empruntés du mineur naturel - ♭III ajoute un moment d'espoir avant de descendre vers ♭VI et ♭VII. Boucle de quatre accords fournit plus de mouvement harmonique tout en maintenant une atmosphère menaçante. Utilisée dans le trap mélodique et la production hip-hop sombre."
      },
      "vi—IV—I": {
        "name": "vi—IV—I",
        "nickname": "Sad Trap",
        "description": "Progression \"sad trap\" émotionnelle. Commence sur le mineur relatif pour la mélancolie, IV-I fournit une résolution familière. La simplicité de trois accords permet de se concentrer sur la mélodie et les 808. Définit l'emo-trap et le rap mélodique de Lil Peep à Juice WRLD, combinant production hip-hop avec vulnérabilité émotionnelle."
      },
      "i—♭VII—♭VI": {
        "name": "i—♭VII—♭VI",
        "nickname": "Lofi Hip-Hop",
        "description": "Progression lofi hip-hop quintessentielle. La tonique mineure descend par ♭VII emprunté vers ♭VI, créant une atmosphère mélancolique et nostalgique. L'ambiguïté modale évite la résolution fonctionnelle. Parfait pour les samples jazzy, le craquement de vinyle et les beats chill pour étudier/relaxer. Fondement de l'esthétique lofi YouTube."
      },
      "i—iv—i—♭VI": {
        "name": "i—iv—i—♭VI",
        "nickname": "Boom Bap",
        "description": "Progression hip-hop boom bap classique. Le i-iv mineur établit une humeur sombre, retour à i confirme la tonalité, ♭VI emprunté ajoute de la couleur avant la boucle. Changements simples et cycliques soutiennent la concentration sur les batteries et le sampling. Définit le hip-hop âge d'or de Premier à Pete Rock."
      },
      "i—♭III—iv—♭VI": {
        "name": "i—♭III—iv—♭VI",
        "nickname": "Emo Rap",
        "description": "Progression émotionnelle emo rap. Tonique mineure vers ♭III crée un élan optimiste, iv mineur ajoute de la vulnérabilité, ♭VI fournit une couleur mélancolique. Mélange d'accords empruntés et de mineur diatonique crée une atmosphère émotionnellement complexe. Utilisé dans l'emo rap moderne et le hip-hop alternatif pour des paroles introspectives."
      },
      "I—♭III—♭VII—IV": {
        "name": "I—♭III—♭VII—IV",
        "nickname": "West Coast",
        "description": "Progression G-funk West Coast. Tonique majeure avec ♭III chromatique (tierce majeure en dessous de la fondamentale), ♭VII ajoute une saveur funk, IV est la sous-dominante traditionnelle. Mélange de tonalité majeure avec emprunt modal crée le son décontracté influencé par Parliament de Dr. Dre, Snoop Dogg et l'ère G-funk."
      },
      "ii7—V7—IM7": {
        "name": "ii7—V7—IM7",
        "nickname": "Lofi Jazz",
        "description": "Palette jazzy et nostalgique. Tous accords de 7e, pas de triades simples - vibes chaudes, poussiéreuses et vinyle."
      },
      "i—♭VII—iv": {
        "name": "i—♭VII—iv",
        "nickname": "Footwork Juke",
        "description": "Palette frénétique de Chicago. Harmonie simple pour des rythmes hachés complexes à 160bpm."
      }
    },
    "Latin/Bossa": {
      "IM7—VI7—ii7—V7": {
        "name": "IM7—VI7—ii7—V7",
        "nickname": "Bossa Nova",
        "description": "Changements bossa nova classiques. IM7 établit une tonalité jazzy, VI7 est une dominante secondaire chromatique (dominante de ii), puis ii7-V7 traditionnel. Tous les accords de 7e créent un son brésilien sophistiqué. Le VI7-ii7 crée une conduite des voix chromatique douce. Fondement de João Gilberto et Antonio Carlos Jobim."
      },
      "i—iv—V—i": {
        "name": "i—iv—V—i",
        "nickname": "Tango",
        "description": "Progression tango argentin traditionnelle. Le i-iv mineur établit un caractère mélancolique, V majeur crée la tension (saveur de mineur harmonique), résout vers i. La résolution dramatique de mineur vers V majeur crée une qualité passionnée et désirante essentielle au tango. Pensez à Piazzolla et à la milonga traditionnelle."
      },
      "I—♭II—I—V": {
        "name": "I—♭II—I—V",
        "nickname": "Flamenco",
        "description": "Cadence phrygienne flamenco. I majeur vers ♭II crée un clash de demi-ton caractéristique (mode Phrygien), retour à I, puis V. Le ♭II est le son flamenco le plus distinctif, créant un caractère espagnol/mauresque. Utilisé dans la rumba flamenca, les bulerías et les traditions de guitare espagnole."
      },
      "i—V—i—VII": {
        "name": "i—V—i—VII",
        "nickname": "Samba",
        "description": "Progression samba brésilienne. Le i-V-i mineur établit la maison, VII majeur (du mineur naturel, pas harmonique) ajoute luminosité et mouvement vers l'avant vers i. Le VII naturel au lieu de la sensible crée un son modal, moins européen caractéristique de la musique populaire brésilienne et du pagode."
      },
      "I—V/ii—ii—V/V—V": {
        "name": "I—V/ii—ii—V/V—V",
        "nickname": "Latin Jazz",
        "description": "Progression jazz latine avancée avec doubles dominantes secondaires. V/ii approche ii chromatiquement, V/V (dominante de la dominante) intensifie l'approche vers V. Crée un mouvement harmonique maximal à travers la conduite chromatique des voix. Utilisé dans le jazz latin, la salsa et le jazz afro-cubain pour une couleur sophistiquée."
      },
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Bolero",
        "description": "Progression bolero romantique. Le i mineur avec ♭VII et ♭VI empruntés crée une descente mélancolique, puis V majeur fournit une tension dramatique. Les accords modaux empruntés combinés avec le V de mineur harmonique créent un caractère passionné. Fondement de la tradition bolero mexicaine et cubaine de Trio Los Panchos à Luis Miguel."
      }
    },
    "Film/Cinematic": {
      "I—♭VI—♭III—♭VII": {
        "name": "I—♭VI—♭III—♭VII",
        "nickname": "Epic Trailer",
        "description": "Progression trailer épique moderne. Tonique majeure avec tous les accords bémol empruntés crée un son cinématographique massif. Les médiantes chromatiques (♭VI, ♭III) fournissent des changements harmoniques dramatiques, ♭VII ajoute la puissance mixolydienne. Définit Two Steps From Hell, les trailers Hans Zimmer et le marketing de films d'action modernes."
      },
      "i—♭VI—♭VII—i": {
        "name": "i—♭VI—♭VII—i",
        "nickname": "Dark Cinematic",
        "description": "Progression de musique de film sombre et sinistre. Tonique mineure avec ♭VI et ♭VII empruntés crée une atmosphère inquiétante, retourne à i pour une tension cyclique. L'ambiguïté modale évite la résolution. Utilisée dans les musiques de thriller, d'horreur et de drame sombre pour une tension psychologique soutenue sans cadences traditionnelles."
      },
      "I—V—vi—♭VI—IV": {
        "name": "I—V—vi—♭VI—IV",
        "nickname": "Emotional Score",
        "description": "Progression orchestrale émotionnelle. Commence avec des changements pop familiers I-V-vi, puis ♭VI (médiante chromatique) crée un changement émotionnel inattendu avant que IV ne résolve. Le ♭VI est le \"twist\" - moment dramatique dans le récit. Courant dans les apogées émotionnelles, les révélations de personnages et les musiques de film romantiques."
      },
      "i—♭III—♭VII—♭VI—V": {
        "name": "i—♭III—♭VII—♭VI—V",
        "nickname": "Heroic Theme",
        "description": "Progression d'action montante héroïque. Le i mineur vers ♭III majeur crée un élan optimiste, ♭VII et ♭VI ajoutent de la couleur, V majeur (mineur harmonique) crée une résolution dramatique. Mélange d'emprunt modal et de V-i fonctionnel fournit à la fois portée épique et résolution satisfaisante. Utilisé pour les thèmes de héros et les moments triomphants."
      },
      "I—♭VII—♭VI—♭VII": {
        "name": "I—♭VII—♭VI—♭VII",
        "nickname": "Adventure",
        "description": "Progression d'aventure et d'exploration. I majeur avec ♭VII mixolydien crée un son optimiste et ouvert. Le ♭VI ajoute une couleur mystérieuse, ♭VII oscille créant un mouvement vers l'avant. Évite les accords mineurs pour une sensation d'aventure pure. Pensez à Indiana Jones, comédies d'aventure et montages d'expédition."
      },
      "i—iv—♭VI—♭III": {
        "name": "i—iv—♭VI—♭III",
        "nickname": "Suspense",
        "description": "Progression de suspense et de mystère. Le i-iv mineur établit la tension, ♭VI ajoute l'obscurité, ♭III fournit un bref espoir avant de boucler. Tous les accords empruntés/diatoniques mineurs évitent la résolution, maintenant un malaise constant. Parfait pour le travail de détective, les scènes de traque et la musique de fond de thriller psychologique."
      },
      "I—♭III—♭VI—♭II": {
        "name": "I—♭III—♭VI—♭II",
        "nickname": "Chromatic Film",
        "description": "Progression de médiantes chromatiques extrême. Toutes les fondamentales sont des médiantes chromatiques (tierces majeures ou mineures de distance). Crée une instabilité et une surprise harmoniques maximales. Le ♭II (napolitain) est particulièrement frappant. Utilisé pour des scènes surréalistes, des séquences de rêve, des ruptures psychologiques et des musiques de film d'avant-garde."
      }
    },
    "Folk/Singer-Songwriter": {
      "I—IV—I—V": {
        "name": "I—IV—I—V",
        "nickname": "Folk Standard",
        "description": "Progression folk simple et intemporelle. I-IV établit la maison, retour à I confirme la tonalité, V crée la tension pour le cycle suivant. Structure de phrase de deux mesures parfaite pour les chansons couplet-refrain. Fondement du folk américain de Woody Guthrie à Bob Dylan, met l'accent sur les paroles plutôt que la complexité harmonique."
      },
      "vi—IV—V—I": {
        "name": "vi—IV—V—I",
        "nickname": "Sad Folk",
        "description": "Progression auteur-compositeur mélancolique. Commence sur le mineur relatif pour une ouverture introspective, IV-V-I crée un arc émotionnel ascendant vers la résolution. Courant dans le folk confessionnel et indie. L'arc de la tristesse (vi) à l'espoir (I) reflète la narration narrative. Pensez à Elliott Smith, Iron & Wine."
      },
      "I—V—IV—I": {
        "name": "I—V—IV—I",
        "nickname": "Country",
        "description": "Progression country classique. I-V crée la tension, IV-I fournit une résolution de cadence plagale \"amen\". Le IV-I (sous-dominante-tonique) est plus doux que V-I, créant une sensation country chaleureuse et familière. Fondement de la country traditionnelle, du bluegrass et du honky-tonk de Hank Williams à Nashville moderne."
      },
      "I—iii—IV—V": {
        "name": "I—iii—IV—V",
        "nickname": "Classic Folk",
        "description": "Progression folk ascendante. I vers iii crée un mouvement ascendant doux (relation de médiante), IV-V continue l'ascension vers I. Tous les accords diatoniques créent un son pur et consonant. L'accord iii ajoute de la sophistication au-delà du simple I-IV-V. Utilisé dans les ballades folk traditionnelles et les classiques auteur-compositeur."
      },
      "IV—V—I—vi": {
        "name": "IV—V—I—vi",
        "nickname": "Americana",
        "description": "Progression roots americana. Commence sur IV (sous-dominante) pour une sensation ouverte et nostalgique, V-I fournit une cadence forte, vi trompeur ajoute de la mélancolie avant la boucle. Mélange d'optimisme (IV-V-I) et de tristesse (vi) capture le caractère americana doux-amer. Courant dans l'alt-country et l'americana de Wilco à Jason Isbell."
      },
      "I—V—vi—iii": {
        "name": "I—V—vi—iii",
        "nickname": "Irish Folk",
        "description": "Progression folk celtique. Ouverture familière I-V, descend vers vi puis iii. Évite l'accord IV, créant une couleur différente des progressions pop typiques. Le motif de tierces descendantes (V-vi, vi-iii) crée un mouvement mélodique fluide caractéristique des ballades irlandaises et des traditions musicales celtiques."
      },
      "I—V—vi—IV": {
        "name": "I—V—vi—IV",
        "nickname": "Post-Rock Build",
        "description": "Palette ouverte et évolutive. Accords majeurs, voicings quartaux, maj7 pour des montées texturales."
      }
    },
    "Metal/Rock": {
      "i—♭VI—♭VII—i": {
        "name": "i—♭VI—♭VII—i",
        "nickname": "Power Metal",
        "description": "Progression power metal classique. Le i mineur naturel avec ♭VI et ♭VII empruntés, retourne à i pour le cycle. Tous power chords (pas de tierces) créent une qualité majeure/mineure ambiguë. Sensation entraînante et anthémique parfaite pour les rythmes galopants. Fondement d'Iron Maiden, Helloween et du power metal européen."
      },
      "i—♭III—♭VI—♭VII": {
        "name": "i—♭III—♭VI—♭VII",
        "nickname": "Doom Metal",
        "description": "Progression doom metal descendante. Le i mineur vers ♭III majeur crée un bref espoir, descend par ♭VI vers ♭VII, évitant la résolution. Tempo lent et écrasant met l'accent sur l'obscurité modale. Tous les accords empruntés/mineur naturel créent une atmosphère oppressante. Caractéristique de Black Sabbath et de la tradition doom metal."
      },
      "i—v—♭VII—iv": {
        "name": "i—v—♭VII—iv",
        "nickname": "Prog Metal",
        "description": "Progression metal progressif. Le i et v mineurs (v mineur naturel, pas V majeur) établissent un son modal, ♭VII ajoute de la couleur, iv mineur crée un mouvement plagal. Évite la résolution traditionnelle V-i pour une harmonie plus sophistiquée et modale. Utilisé dans le prog metal et le djent pour une tonalité complexe et ambiguë."
      },
      "i—♭II—i": {
        "name": "i—♭II—i",
        "nickname": "Thrash",
        "description": "Progression thrash metal agressive. Le i mineur vers ♭II napolitain crée un clash de demi-ton et une tension extrême, retourne à i. Caractère chromatique et dissonant parfait pour des tempos rapides et des riffs agressifs. Le ♭II fournit une obscurité maximale. Caractéristique de Slayer, Metallica et de l'intensité thrash metal."
      },
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Melodic Metal",
        "description": "Progression metal mélodique avec résolution de mineur harmonique. Descend par ♭VII et ♭VI empruntés, se termine sur V majeur (du mineur harmonique) créant une forte attraction vers i. Combine couleur modale avec cadence fonctionnelle. Utilisé dans le melodic death metal et le metal néoclassique pour un son dramatique influencé par le classique européen."
      },
      "i—iv—v—i": {
        "name": "i—iv—v—i",
        "nickname": "Minor Rock",
        "description": "Progression rock en mineur naturel pur. Le i-iv-v mineur (tous mineurs/diminués de la gamme mineure naturelle) évite le V majeur du mineur harmonique. Crée un son plus sombre et plus modal que le mineur classique. Le v mineur naturel au lieu de V réduit la tension, créant une atmosphère plus lourde et moins résolue pour le heavy rock et le metal."
      }
    },
    "Trance/Psytrance/Goa": {
      "i—♭VII—i—♭VI": {
        "name": "i—♭VII—i—♭VI",
        "nickname": "Classic Goa",
        "description": "Progression Goa trance quintessentielle. Le i mineur oscille avec ♭VII et ♭VI empruntés, créant une atmosphère modale hypnotique. Évite la résolution fonctionnelle, mettant l'accent sur la qualité cyclique et méditative. Les accords empruntés du mineur naturel créent le caractère psychédélique. Fondement de la Goa trance primitive de Goa Gil à Astral Projection."
      },
      "i—♭II—♭VII—i": {
        "name": "i—♭II—♭VII—i",
        "nickname": "Phrygian Dominant",
        "description": "Progression de gamme Phrygien Dominant exotique. Le i mineur vers ♭II (napolitain) crée un caractère moyen-oriental/indien, ♭VII ajoute une couleur modale, retourne à i. Le clash de demi-ton ♭II crée une atmosphère mystique et spirituelle parfaite pour la trance psychédélique. Utilisé dans la psytrance pour un son ethnique et transcendant."
      },
      "i—V—♭VI—♭VII": {
        "name": "i—V—♭VI—♭VII",
        "nickname": "Uplifting Trance",
        "description": "Arc émotionnel uplifting trance. Le i mineur vers V majeur (mineur harmonique) crée l'espoir, puis ♭VI et ♭VII ajoutent une couleur modale avant de cycler. Mélange de V fonctionnel et d'emprunt modal crée un élan et une libération euphoriques. Définit l'uplifting trance d'Armin van Buuren à Above & Beyond pour les pics émotionnels et les breakdowns."
      },
      "i—iv—VII—III": {
        "name": "i—iv—VII—III",
        "nickname": "Harmonic Minor Psy",
        "description": "Progression psytrance en mineur harmonique pur. Utilise exclusivement la gamme mineure harmonique - i, iv, VII majeur, III majeur. La 7e élevée crée un intervalle de seconde augmentée exotique. Caractère dramatique est-européen. Le VII et III majeurs créent un mouvement ascendant lumineux contre la tonique mineure sombre pour un contraste psychédélique."
      },
      "i—♭VI—III—VII": {
        "name": "i—♭VI—III—VII",
        "nickname": "Dark Psy",
        "description": "Progression dark psytrance mélangeant les modes. Le i mineur et ♭VI du mineur naturel, III et VII majeurs du mineur harmonique. Crée une ambiguïté et une tension harmoniques maximales. L'ascension de ♭VI par III vers VII construit l'intensité. Utilisé dans la dark psy et la forest trance pour une atmosphère sinistre et alien."
      },
      "i—♭III—♭VI—V": {
        "name": "i—♭III—♭VI—V",
        "nickname": "Progressive Psy",
        "description": "Psytrance progressive avec résolution fonctionnelle. Les ♭III et ♭VI empruntés du mineur naturel créent une couleur modale, V majeur (mineur harmonique) fournit une forte attraction vers i. Combine son modal psychédélique avec résolution satisfaisante. Utilisé dans la psytrance progressive pour des montées et des libérations structurées."
      },
      "i—VII—VI—VII": {
        "name": "i—VII—VI—VII",
        "nickname": "Full-On",
        "description": "Full-on psytrance avec luminosité de mineur harmonique. Le i mineur contraste avec VII et VI majeurs (du mineur harmonique), VII oscille pour une énergie entraînante. Les accords majeurs créent un caractère énergique et élevant malgré la tonique mineure. Caractéristique du son agressif et euphorique de la full-on psytrance à 140-148 BPM."
      },
      "i—♭II—VII—V": {
        "name": "i—♭II—VII—V",
        "nickname": "Goa Classic",
        "description": "Goa trance classique avec gammes exotiques. Le i mineur vers ♭II (couleur phrygienne), VII et V majeurs du mineur harmonique. Mélange de Phrygien et mineur harmonique crée un son complexe influencé par l'Orient. Les intervalles chromatiques et exotiques créent le caractère spirituel et psychédélique de la scène Goa trance originale."
      },
      "i—iv—i—VII": {
        "name": "i—iv—i—VII",
        "nickname": "Forest Psy",
        "description": "Progression forest psytrance organique. Le simple i-iv établit le caractère mineur, retour à i, VII majeur (mineur harmonique) ajoute de la luminosité. Changements d'accords minimaux concentrent l'attention sur les textures organiques et les rythmes complexes. Crée une atmosphère terrestre et naturelle caractéristique de la forest psytrance et des styles psy minimaux plus sombres."
      },
      "i—III—VII—IV": {
        "name": "i—III—VII—IV",
        "nickname": "Morning Trance",
        "description": "Progression psytrance matinale lumineuse. Le i mineur contraste avec III, VII et IV majeurs (du mélange mineur harmonique/Dorien). Les accords majeurs créent une énergie optimiste de lever de soleil. Mouvement ascendant (i-III-VII) puis résolution vers IV crée un arc élevant. Utilisé dans les sets de psytrance matinaux pour une atmosphère positive et énergique au lever du soleil."
      },
      "i—v—♭VII": {
        "name": "i—v—♭VII",
        "nickname": "Minimal Trance",
        "description": "Palette hypnotique et entraînante. Triades mineures et majeures avec 7es pour des boucles répétitives."
      }
    },
    "Jungle/Drum'n'Bass": {
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Liquid DnB",
        "description": "Progression liquid drum and bass. Descend par ♭VII et ♭VI empruntés, résout avec V majeur (mineur harmonique). Crée une atmosphère émotionnelle et mélodique sur des breakbeats rapides. La résolution fonctionnelle V-i fournit une clôture satisfaisante malgré les accords sombres. Définit le liquid funk et le DnB atmosphérique pour un caractère soul et jazzy."
      },
      "i—♭III—♭VII—iv": {
        "name": "i—♭III—♭VII—iv",
        "nickname": "Neurofunk",
        "description": "Progression neurofunk sombre. Le i mineur vers ♭III crée un changement chromatique, ♭VII et iv mineur ajoutent une obscurité modale. Évite le V majeur pour une atmosphère non résolue et mécanique. Crée un son sci-fi dystopique sur des lignes de basse reece complexes. Caractéristique du neurofunk et du tech step DnB de Noisia à Phace pour un son agressif et futuriste."
      },
      "i—v—♭VII—iv": {
        "name": "i—v—♭VII—iv",
        "nickname": "Jump-Up",
        "description": "Progression jump-up drum and bass. Tous les accords mineurs/diminués du mineur naturel - i, v (pas V majeur), ♭VII, iv. Crée un caractère de ligne de basse rebondissante et roulante. Évite la résolution pour une énergie continue. Harmonie simple et fonctionnelle soutient la concentration sur les wobbles de basse et les samples ragga dans les styles jump-up et roller DnB."
      },
      "ii7—V7—IM7—vi7": {
        "name": "ii7—V7—IM7—vi7",
        "nickname": "Jazzstep",
        "description": "Drum and bass intelligent influencé par le jazz. Progression jazz classique ii7-V7-IM7 avec vi7 trompeur. Tous les accords de 7e créent un son sophistiqué et atmosphérique. L'harmonie jazz sur des breakbeats rapides définit le DnB intelligent et le jazzstep. Utilisé par LTJ Bukem, Calibre et les producteurs de jungle atmosphérique pour une approche raffinée et musicale à 170+ BPM."
      }
    },
    "Italo-Disco/House": {
      "I—vi—IV—V": {
        "name": "I—vi—IV—V",
        "nickname": "Classic Italo",
        "description": "Progression doo-wop des années 1950 réutilisée pour l'Italo disco. I-vi crée une mélancolie douce, IV-V complète le cercle. Changements simples et romantiques parfaits pour les arpèges de synthétiseur et les vocodeurs. Fondement de l'Italo disco des années 1980 de Gazebo à Baltimora, combinant nostalgie avec production futuriste."
      },
      "I—iii—vi—IV": {
        "name": "I—iii—vi—IV",
        "nickname": "Italo Romantic",
        "description": "Progression Italo romantique. Descend de I par iii vers vi (tous par tierces), puis IV fournit un élan. Mouvement doux et fluide crée un caractère européen rêveur. L'accord iii ajoute de la sophistication au-delà de la pop typique. Utilisé dans les ballades Italo romantiques et les morceaux house émotionnels pour une atmosphère mélancolique et nostalgique."
      },
      "I—IV—V—iii": {
        "name": "I—IV—V—iii",
        "nickname": "Italo House",
        "description": "Progression Italo house. I-IV-V classique avec iii inattendu au lieu de retourner à I. Crée une fin surprise avant la boucle, ajoutant de l'intérêt aux grooves four-on-the-floor. L'accord iii maintient l'énergie tout en variant la résolution I attendue. Pont entre l'Italo des années 80 et la production house italienne des années 90."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Italo Pop",
        "description": "Progression Italo influencée par la pop. Commence sur le mineur relatif pour l'émotion, séquence familière vi-IV-I, se termine sur V pour une forte attraction vers le début. Crée une boucle parfaite pour la piste de danse. Cette progression est devenue omniprésente dans l'Europop des années 2000 et l'EDM, connectant la tradition Italo disco à la pop électronique moderne."
      },
      "I—V—vi—iii—IV—I": {
        "name": "I—V—vi—iii—IV—I",
        "nickname": "Extended Italo",
        "description": "Progression Italo étendue de six mesures. Séquence descendante inspirée de Pachelbel I-V-vi-iii, puis IV-I fournit la clôture. La forme plus longue permet un développement mélodique et rythmique plus élaboré. Utilisée dans les morceaux Italo disco étendus et la progressive house pour construire tension et libération sur des périodes plus longues."
      },
      "IM7—vi7—IVM7—V7": {
        "name": "IM7—vi7—IVM7—V7",
        "nickname": "Smooth Italo",
        "description": "Italo sophistiquée avec voicings jazz. I-vi-IV-V classique avec tous les accords de 7e crée un son luxuriant et doux. Les 7es majeures et mineures ajoutent une richesse harmonique au-delà des simples triades. Représente l'évolution de l'Italo vers une production plus raffinée. Utilisée dans la smooth house et le nu-disco pour un attrait sophistiqué sur la piste de danse."
      },
      "i—iv": {
        "name": "i—iv",
        "nickname": "Minimal House",
        "description": "Palette hypnotique et épurée. Accords mineurs propres avec extensions de 7e subtiles."
      }
    },
    "Synthwave/Retrowave": {
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Outrun",
        "description": "Progression synthwave outrun classique. Descend par ♭VII et ♭VI empruntés du mineur naturel, résout avec V majeur du mineur harmonique. Crée une atmosphère nostalgique des années 80 avec production moderne. La résolution V-i fournit une cadence satisfaisante. Définit le synthwave de Kavinsky à Mitch Murder pour un son rétro-futuriste."
      },
      "i—♭III—♭VII—♭VI": {
        "name": "i—♭III—♭VII—♭VI",
        "nickname": "Darkwave",
        "description": "Progression synthwave sombre. Le i mineur avec tous les accords empruntés du mineur naturel crée une atmosphère menaçante. ♭III fournit un bref espoir avant de descendre vers ♭VII et ♭VI. Évite le V majeur pour un caractère plus sombre et non résolu. Utilisé dans le darksynth et le horror synth pour des paysages sonores cyberpunk dystopiques et menaçants."
      },
      "I—V—vi—IV": {
        "name": "I—V—vi—IV",
        "nickname": "Synthpop",
        "description": "Progression synthpop moderne. L'omniprésent \"Axis of Awesome\" I-V-vi-IV réimaginé avec des synthétiseurs vintage. La tonalité majeure crée une nostalgie optimiste des années 80. Changements simples et accrocheurs parfaits pour les refrains vocaux et les mélodies de synthé. Connecte la new wave des années 80 au revival synthpop moderne et à l'électronique indie."
      },
      "i—v—♭VI—♭VII": {
        "name": "i—v—♭VI—♭VII",
        "nickname": "Cyberpunk",
        "description": "Progression synthwave cyberpunk. Le i-v mineur naturel (v mineur, pas V majeur) établit une fondation modale sombre, ♭VI et ♭VII empruntés ajoutent une couleur dystopique. Évite la résolution fonctionnelle pour une atmosphère mécanique et futuriste. Parfait pour les thèmes sci-fi, les paysages urbains néon et les productions inspirées de Blade Runner."
      },
      "I—♭VII—♭VI—I": {
        "name": "I—♭VII—♭VI—I",
        "nickname": "Dreamwave",
        "description": "Progression dreamwave avec saveur mixolydienne. I majeur avec ♭VII et ♭VI empruntés crée une atmosphère brumeuse et nostalgique, retourne à I. La tonique majeure avec accords bémol crée un caractère doux-amer. Qualité circulaire et méditative parfaite pour le synthwave ambiant et la chillwave pour des paysages sonores rétro rêveurs et éthérés."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Retrowave Pop",
        "description": "Progression retrowave influencée par la pop. Commence sur le mineur relatif pour une profondeur émotionnelle, cycle à travers des changements familiers avec production années 80. Qualité accessible à chanter ensemble connecte le synthwave à la pop mainstream. Utilisé dans le retrowave radio-friendly et le synthpop pour un attrait commercial tout en maintenant l'esthétique rétro."
      },
      "i—♭VI—III—♭VII": {
        "name": "i—♭VI—III—♭VII",
        "nickname": "Dark Synth",
        "description": "Progression dark synth agressive. Le i mineur et ♭VI emprunté du mineur naturel, III majeur du mineur harmonique crée un élan dramatique, ♭VII ajoute de la puissance. Mélange de modes crée un caractère complexe et menaçant. Utilisé dans le horror synth, la dark electro et les productions cyberpunk agressives pour une intensité et une obscurité maximales."
      },
      "IM7—iii7—vi7—IVM7": {
        "name": "IM7—iii7—vi7—IVM7",
        "nickname": "Vaporwave Dream",
        "description": "Palette nostalgique et rêveuse. Tous accords de 7e pour une esthétique smooth jazz ralentie."
      }
    },
    "African Dance": {
      "I—IV—V—IV": {
        "name": "I—IV—V—IV",
        "nickname": "Soukous Sebene",
        "description": "Progression \"sebene\" (pause instrumentale) soukous. Le I-IV-V majeur avec IV de retour crée une énergie circulaire et entraînante. Funk simple de trois accords parfait pour les lignes de guitare imbriquées complexes. L'oscillation V-IV crée un mouvement perpétuel pour danser. Fondement de la rumba congolaise et du soukous de Franco à Papa Wemba."
      },
      "I—IV—I—V": {
        "name": "I—IV—I—V",
        "nickname": "Soukous Classic",
        "description": "Progression soukous classique. I-IV établit la relation tonique-sous-dominante, retour à I confirme la maison, V crée la tension pour le cycle suivant. Changements simples et répétitifs permettent de se concentrer sur les percussions polyrythmiques et l'interaction des guitares. Fondamental à la musique de danse congolaise et est-africaine pour un groove hypnotique et festif."
      },
      "I—♭VII—IV—I": {
        "name": "I—♭VII—IV—I",
        "nickname": "Soukous Modern",
        "description": "Soukous moderne avec couleur modale. I majeur vers ♭VII emprunté crée une saveur mixolydienne, IV vers I complète la cadence plagale. Le ♭VII ajoute un côté contemporain tout en maintenant l'accessibilité pour la piste de danse. Représente l'évolution du soukous vers l'Afrobeat et la pop africaine contemporaine avec influences occidentales."
      },
      "I—IV—♭VII—I": {
        "name": "I—IV—♭VII—I",
        "nickname": "Makossa Funk",
        "description": "Progression funk makossa camerounaise. I-IV est traditionnel, ♭VII emprunté ajoute une saveur funk avant de retourner à I. Tonalité majeure avec ♭VII modal crée un caractère optimiste et dansant. Le mouvement plagal (IV et ♭VII vers I) évite la dominante, créant une qualité douce et groovy. Fondement du makossa de Manu Dibango à l'Afropop moderne."
      }
    },
    "UK Bass": {
      "i—VII—♭VI": {
        "name": "i—VII—♭VI",
        "nickname": "UK Garage",
        "description": "Palette soul et sautillante. Accords mineurs et majeurs pour des grooves 2-step sautillants."
      },
      "i—♭VI": {
        "name": "i—♭VI",
        "nickname": "Dubstep Wobble",
        "description": "Palette sombre et agressive. Mineur, diminué, dom7 pour menace et basse maximales."
      },
      "i—♭VII—i": {
        "name": "i—♭VII—i",
        "nickname": "Breakbeat",
        "description": "Palette Big Beat énergique. Mineurs et 7es dominantes pour des breaks lourds en samples."
      }
    },
    "Reggae/Dub": {
      "I—IV—I—V": {
        "name": "I—IV—I—V",
        "nickname": "Roots Dub",
        "description": "Palette roots fondamentale. Majeurs et 7es dominantes pour des entraînements de ligne de basse lourds."
      },
      "I—V—IV": {
        "name": "I—V—IV",
        "nickname": "One Drop",
        "description": "Fondation reggae classique. Triades majeures et dom7, pas de mineur pour une sensation authentique."
      },
      "i—♭VII—♭VI": {
        "name": "i—♭VII—♭VI",
        "nickname": "Steppers Dub",
        "description": "Palette profonde et méditative. Mélange mineur et majeur pour des sessions dub steppers 4/4."
      }
    },
    "Acid/EBM": {
      "i—iv—♭VII—i": {
        "name": "i—iv—♭VII—i",
        "nickname": "EBM Classic",
        "description": "Palette sombre et tendue. Mineur, diminué, dom7 pour la musique industrielle corporelle."
      },
      "i—♭VII—iv": {
        "name": "i—♭VII—iv",
        "nickname": "Acid 303",
        "description": "Palette acid classique. 7es mineures et voicings quartaux pour le squelch TB-303."
      }
    }
  }
}
