{
  "app": {
    "title": "Générateur de Progressions d'Accords",
    "subtitle": "Créez des progressions d'accords musicalement intelligentes — visualisez-les en piano, tablatures guitare ou notation classique",
    "subtitleLine2": "Imprimez des grilles d'accords pour jouer avec d'autres, exportez des fichiers MIDI pour votre DAW, ou exportez des fichiers .progression pour l'Akai MPC"
  },
  "chordMatcher": {
    "title": "Recherche d'Accords",
    "optional": "Optionnel",
    "description": "Vous avez trouvé un sample avec de super accords ? Entrez-les ici pour trouver les tonalités et modes compatibles pour votre production.",
    "noteLabel": "Note...",
    "qualityLabel": "Qualité...",
    "qualities": {
      "major": "Majeur",
      "minor": "Mineur",
      "dim": "Diminué",
      "aug": "Augmenté",
      "sus2": "Sus2",
      "sus4": "Sus4",
      "7": "Dominante 7",
      "maj7": "Majeure 7",
      "m7": "Mineure 7"
    },
    "addChord": "Ajouter un Accord",
    "clearAll": "Tout Effacer",
    "compatibleLabel": "Tonalités et Modes Compatibles :"
  },
  "controls": {
    "generationMode": {
      "palette": "Mode Palette de Progressions",
      "scale": "Mode Gamme"
    },
    "headers": {
      "palette": "Mode Palette de Progressions",
      "scale": "Mode Gamme"
    },
    "labels": {
      "key": "Tonalité",
      "mode": "Mode/Gamme",
      "progression": "Palette de Progressions",
      "name": "Nom de Progression",
      "outputName": "Nom de Sortie"
    }
  },
  "buttons": {
    "generate": "Générer les Progressions",
    "downloadAll": "Télécharger tous les fichiers .progression"
  },
  "tabs": {
    "mpc": "Pads MPC",
    "keyboard": "Clavier",
    "guitar": "Guitare",
    "staff": "Portée",
    "midi": "MIDI",
    "leftHanded": "Gaucher",
    "midiOutput": "Sortie MIDI :",
    "midiOutputNone": "Bip du navigateur (pas de MIDI)"
  },
  "footer": {
    "cousin": "Cousin du",
    "finderLink": "MPC Chord Progression Finder",
    "producer": "Produit par Jean-Marc Liotier",
    "github": "Voir sur GitHub"
  },
  "tooltips": {
    "progressionPaletteDisabled": "Les palettes de progressions ne sont pas utilisées en mode Exploration de Gamme. Tous les accords de la gamme sélectionnée seront générés.",
    "progressionPaletteEnabled": "Chaque palette fournit 16 accords uniques : les N premiers de la progression, les pads restants issus de l'harmonie étendue. Des filtres spécifiques au genre assurent des couleurs d'accords appropriées."
  },
  "errors": {
    "selectKey": "Veuillez sélectionner une tonalité",
    "selectMode": "Veuillez sélectionner un mode",
    "selectProgression": "Veuillez sélectionner une progression",
    "generateFailed": "Échec de la génération de progression"
  },
  "messages": {
    "loading": "Chargement...",
    "generating": "Génération des progressions...",
    "complete": "Génération terminée"
  },
  "chordRoles": {
    "I": "Tonique - l'accord de repos, apporte résolution et stabilité.",
    "II": "Sus-tonique - accord de pré-dominante, mène souvent vers V.",
    "III": "Médiante - pré-dominante faible ou accord de couleur, relie I et IV/vi.",
    "IV": "Sous-dominante - accord de pré-dominante, prépare le mouvement vers V.",
    "V": "Dominante - crée une tension qui se résout sur I.",
    "VI": "Sus-dominante - relatif mineur, souvent utilisé pour des cadences trompeuses.",
    "VII°": "Sensible - accord diminué, attire fortement vers I.",
    "♭II": "Seconde napolitaine empruntée, forte pré-dominante, prépare V.",
    "♭III": "Emprunté au mode parallèle mineur, ajoute une couleur dramatique, substitue I.",
    "♭IV": "Sous-dominante mineure empruntée, adoucit le mouvement vers V.",
    "♭V": "Accord emprunté rare, couleur chromatique.",
    "♭VI": "Emprunté au mode parallèle mineur, pré-dominante dramatique, se déplace souvent vers V.",
    "♭VII": "Emprunté au mixolydien, donne une saveur rock/blues, se déplace souvent vers I ou V.",
    "V/II": "Dominante secondaire - tonicise ii, crée un mouvement vers ii.",
    "V/III": "Dominante secondaire - tonicise iii, rarement utilisé mais coloré.",
    "V/IV": "Dominante secondaire - tonicise IV, éclaircit la progression.",
    "V/V": "Dominante secondaire - tonicise V, très courant pour renforcer la cadence.",
    "V/VI": "Dominante secondaire - tonicise vi, utilisé pour des changements trompeurs.",
    "VII°/II": "Accord de sensible de ii, se résout fortement sur ii.",
    "VII°/III": "Accord de sensible de iii, se résout fortement sur iii.",
    "VII°/IV": "Accord de sensible de IV, se résout fortement sur IV.",
    "VII°/V": "Accord de sensible de V, se résout fortement sur V.",
    "VII°/VI": "Accord de sensible de vi, se résout fortement sur vi.",
    "SUBV7": "Substitution tritonique - substitution jazz pour V7, crée un mouvement chromatique des voix.",
    "♯I°": "Diminué de passage - connecteur chromatique entre accords diatoniques.",
    "♯II°": "Diminué de passage - connecteur chromatique entre accords diatoniques.",
    "sus": "Accord suspendu - remplace la tierce par une seconde/quarte, crée une suspension avant résolution.",
    "add9": "Ajoute de la brillance, couleur rêveuse.",
    "6": "Couleur vintage, adoucit l'harmonie.",
    "extended": "Harmonie étendue - couleur jazz/pop, ajoute de la profondeur.",
    "borrowed": "Accord emprunté - ajoute une couleur expressive en empruntant au mode parallèle.",
    "default": "Couleur harmonique - ajoute variété et intérêt à la progression."
  },
  "modeCategories": {
    "Common Western Tonal": "Modes Tonaux Occidentaux Courants",
    "Compact/Popular": "Compacts/Populaires",
    "Symmetrical/Jazz": "Symétriques/Jazz",
    "Arabic Maqamat": "Maqâmât Arabes",
    "Indian Ragas": "Râgas Indiens",
    "Exotic": "Exotiques"
  },
  "modes": {
    "Major": {
      "name": "Major",
      "description": "La gamme fondamentale de la musique occidentale. Schéma : T-T-½T-T-T-T-½T (tons et demi-tons). Crée un caractère lumineux, joyeux et résolu. Toutes les triades diatoniques (I, ii, iii, IV, V, vi, vii°) proviennent de cette gamme. Fondement de la musique classique, pop et folk pour une tonalité optimiste et stable."
    },
    "Minor": {
      "name": "Minor",
      "description": "Gamme mineure naturelle (mode Éolien). Schéma : T-½T-T-T-½T-T-T. Crée un caractère triste, introspectif, plus sombre que le majeur. Les 3e, 6e et 7e degrés abaissés la distinguent du majeur. Utilisée dans tous les genres pour des humeurs mélancoliques, émotionnelles ou sérieuses. Fondement de l'harmonie en tonalité mineure."
    },
    "Dorian": {
      "name": "Dorian",
      "description": "Gamme mineure avec 6e degré élevé. Schéma : T-½T-T-T-T-½T-T. Crée un son mineur sophistiqué - plus sombre que le majeur mais plus lumineux que le mineur naturel. L'accord de IV majeur le distingue de l'Éolien. Utilisé dans le jazz, le funk, le folk et la musique modale pour une tonalité mineure cool et sophistiquée sans tristesse lourde."
    },
    "Phrygian": {
      "name": "Phrygian",
      "description": "Gamme mineure avec 2e degré abaissé. Schéma : ½T-T-T-T-½T-T-T. Crée un caractère espagnol, moyen-oriental ou metal sombre. Le demi-ton entre la tonique et la 2e crée un son exotique distinctif. Utilisé dans le flamenco, le metal et la musique espagnole pour une atmosphère mystérieuse, sinistre ou ethnique."
    },
    "Lydian": {
      "name": "Lydian",
      "description": "Gamme majeure avec 4e degré élevé. Schéma : T-T-T-½T-T-T-½T. Crée un caractère rêveur, flottant, éthéré - encore plus lumineux que le majeur. La 4e élevée (#11) crée le son \"Lydien\" distinctif. Utilisé dans les musiques de film, le jazz et le rock progressif pour une qualité magique, surnaturelle ou flottante."
    },
    "Mixolydian": {
      "name": "Mixolydian",
      "description": "Gamme majeure avec 7e degré abaissé. Schéma : T-T-½T-T-T-½T-T. Crée un caractère bluesy, rock ou folk. L'accord de ♭VII est caractéristique. Utilisé abondamment dans le rock, le blues, le folk et le funk pour un son majeur ancré et terreux sans la tension de la sensible. Fondement de l'harmonie rock and roll."
    },
    "Locrian": {
      "name": "Locrian",
      "description": "Gamme mineure avec 2e et 5e degrés abaissés. Schéma : ½T-T-T-½T-T-T-T. Le mode le plus instable - triade tonique diminuée. Rarement utilisé pour des compositions complètes. La ♭5 crée un triton contre la fondamentale. Utilisé pour la dissonance, la tension ou des passages expérimentaux dans le metal, le jazz et la musique d'avant-garde."
    },
    "Harmonic Minor": {
      "name": "Harmonic Minor",
      "description": "Mineur naturel avec 7e degré élevé. Schéma : T-½T-T-T-½T-2T-½T. L'intervalle de seconde augmentée (entre 6 et 7) crée une tension et un drame exotiques. L'accord de V majeur permet de fortes cadences V-i. Fondement de l'harmonie mineure classique, utilisé dans le metal, le flamenco et la musique moyen-orientale pour un son mineur dramatique et classique."
    },
    "Melodic Minor": {
      "name": "Melodic Minor",
      "description": "Mineur naturel avec 6e et 7e degrés élevés (forme ascendante). Schéma : T-½T-T-T-T-T-½T. Plus doux que le mineur harmonique - pas de seconde augmentée. Utilisé dans le jazz pour l'improvisation modale et dans la musique classique pour l'ascension mélodique. Crée une tonalité mineure sophistiquée avec VI et VII majeurs permettant une conduite des voix fluide."
    },
    "Pentatonic Major": {
      "name": "Pentatonic Major",
      "description": "Gamme à cinq notes : 1-2-3-5-6 (supprime 4 et 7 de la gamme majeure). Absence de demi-tons ou tritons crée un son consonant et ouvert. Gamme universelle trouvée à travers les cultures. Utilisée dans les solos rock, les mélodies folk, les refrains pop et la musique du monde pour des mélodies chantables et accessibles qui fonctionnent sur toute harmonie."
    },
    "Pentatonic Minor": {
      "name": "Pentatonic Minor",
      "description": "Gamme à cinq notes : 1-♭3-4-5-♭7 (supprime 2 et 6 du mineur naturel). Le fondement des solos blues, rock et blues-rock. Absence de demi-tons crée un caractère fluide et coulant. Gamme mineure universelle utilisée à travers les cultures. Essentielle pour les solos de guitare, l'improvisation vocale et les mélodies mineures accessibles."
    },
    "Blues": {
      "name": "Blues",
      "description": "Gamme à six notes : 1-♭3-4-♭5-5-♭7. Ajoute la \"blue note\" (♭5) à la pentatonique mineure. La ♭5 crée le \"bend\" blues caractéristique et la tension. Fondement de l'improvisation blues, rock, jazz et R&B. La ♭3 ambiguë sur des accords majeurs crée la dissonance bluesy. Gamme la plus importante dans la musique populaire américaine."
    },
    "Whole Tone": {
      "name": "Whole Tone",
      "description": "Gamme à six notes construite entièrement de tons entiers : T-T-T-T-T-T. Parfaitement symétrique - pas de tonique ni de résolution. Crée un caractère rêveur, flottant, surréaliste. Pas de quintes ou quartes justes, seulement des accords augmentés. Utilisée par Debussy et dans le jazz pour une atmosphère ambiguë, impressionniste et surnaturelle. Définit le surréalisme musical."
    },
    "Diminished (W-H)": {
      "name": "Diminished (W-H)",
      "description": "Gamme octatonique à huit notes alternant tons et demi-tons : T-½T-T-½T-T-½T-T-½T. Parfaitement symétrique, divise l'octave en quatre parties égales. Utilisée sur les accords de dominante 7 dans le jazz. Crée un caractère tendu, instable et chromatique. Essentielle au bebop pour les sons de dominante altérée et le jeu outside."
    },
    "Diminished (H-W)": {
      "name": "Diminished (H-W)",
      "description": "Gamme octatonique à huit notes alternant demi-tons et tons : ½T-T-½T-T-½T-T-½T-T. Schéma inversé du diminué T-½T. Utilisée sur les accords diminués 7. La structure symétrique crée un caractère tendu et non résolu. Essentielle au jazz pour l'improvisation sur accords diminués et la conduite chromatique des voix en composition."
    },
    "Augmented": {
      "name": "Augmented",
      "description": "Gamme hexatonique à six notes construite à partir de triades augmentées avec notes de passage : 1-♭3-3-5-♯5-7. Symétrique, divise l'octave en trois tierces majeures égales. Pas de quintes justes. Crée un caractère ambigu, flottant, moderniste. Utilisée dans la musique classique du 20e siècle et le jazz pour des contextes d'accords augmentés et des structures harmoniques symétriques."
    },
    "Maqam Hijaz": {
      "name": "Maqam Hijaz",
      "description": "Maqâm arabe approximé en tempérament égal comme Phrygien Dominant : 1-♭2-3-4-5-♭6-♭7. La seconde augmentée entre ♭2 et 3 crée le son moyen-oriental caractéristique. Combine le ♭2 phrygien avec la tierce majeure. Utilisé dans la musique arabe, turque et klezmer pour un caractère exotique, spirituel et oriental. Évoque la prière et le mysticisme."
    },
    "Maqam Bayati": {
      "name": "Maqam Bayati",
      "description": "Maqâm arabe approximé comme Phrygien : 1-♭2-♭3-4-5-♭6-♭7. Similaire au mode Phrygien mais avec des inflexions microtonales dans l'interprétation traditionnelle. Crée un caractère mélancolique et contemplatif moyen-oriental. L'un des maqâmât arabes les plus courants. Utilisé dans le monde arabe pour des mélodies émotionnelles et introspectives."
    },
    "Maqam Rast": {
      "name": "Maqam Rast",
      "description": "Maqâm arabe approximé comme majeur : 1-2-3-4-5-6-7, mais avec des variations microtonales de quart de ton traditionnellement. Considéré comme maqâm \"neutre\" ou \"reposant\". Caractère lumineux et stable similaire au majeur occidental mais avec de subtiles inflexions orientales. Maqâm fondamental dans la théorie musicale arabe. Utilisé pour des mélodies joyeuses, festives ou dignes."
    },
    "Maqam Saba": {
      "name": "Maqam Saba",
      "description": "Maqâm arabe au caractère distinctivement triste et nostalgique. Approximé comme 1-♭2-♭3-♭4-♭5-♭6-♭7. Plusieurs degrés abaissés créent une atmosphère sombre et mélancolique. La ♭4 est particulièrement caractéristique. Utilisé pour des expressions profondément émotionnelles et tristes dans la musique arabe. Crée une tristesse et un désir profonds."
    },
    "Maqam Kurd": {
      "name": "Maqam Kurd",
      "description": "Maqâm arabe identique au mode Phrygien : 1-♭2-♭3-4-5-♭6-♭7. L'un des maqâmât de type mineur les plus importants. Crée un caractère mélancolique mais digne. Le nom kurde reflète les origines historiques. Utilisé dans tout le Moyen-Orient pour une musique sérieuse et contemplative. Qualité émotionnelle similaire au mineur naturel occidental mais avec la couleur phrygienne ♭2."
    },
    "Bhairav": {
      "name": "Bhairav",
      "description": "Râga matinal, identique à la gamme Double Harmonique : 1-♭2-3-4-5-♭6-7. Deux secondes augmentées (♭2-3 et ♭6-7) créent une tension dramatique distinctive. Associé à Shiva. Caractère sérieux et dévotionnel. Utilisé dans la musique classique nord-indienne pour la méditation matinale et la contemplation spirituelle. Crée une atmosphère exotique, intense et puissante."
    },
    "Kafi": {
      "name": "Kafi",
      "description": "Râga d'après-midi/soirée, identique au mode Dorien : 1-2-♭3-4-5-6-♭7. L'une des dix gammes mères (thaat) dans la musique hindoustanie. Crée un caractère paisible et romantique. La 6e majeure le distingue du mineur naturel. Utilisé dans la musique dévotionnelle et classique légère pour des humeurs douces, sucrées et contemplatives. Similaire au Dorien occidental mais avec ornementation indienne."
    },
    "Yaman": {
      "name": "Yaman",
      "description": "Râga du soir, identique au mode Lydien : 1-2-3-♯4-5-6-7. L'un des râgas les plus populaires dans la musique classique hindoustanie. Crée un caractère paisible, romantique et dévotionnel. La ♯4 (tivra ma) est caractéristique. Associé à la création et au printemps. Utilisé pour des expressions sereines, belles et élevantes. Évoque la tranquillité et la beauté spirituelle."
    },
    "Bhairavi": {
      "name": "Bhairavi",
      "description": "Râga matinal mais joué à tout moment, identique au Phrygien : 1-♭2-♭3-4-5-♭6-♭7. L'une des dix gammes mères. Crée un caractère dévotionnel et sérieux avec flexibilité pour l'ornementation. Associé à la déesse Parvati. Utilisé pour les prières matinales et les performances d'adieu. Râga le plus flexible, permet des variations chromatiques. Évoque la dévotion et le pathos."
    },
    "Todi": {
      "name": "Todi",
      "description": "Râga de midi avec gamme unique : 1-♭2-♭3-♯4-5-♭6-7. Combine le ♭2 phrygien, la 4e élevée (lydienne) et la 7e majeure. Crée un caractère intense, nostalgique et passionné. Considéré comme l'un des râgas les plus sérieux et dévotionnels. Associé à l'émotion profonde et au désir. Les intervalles augmentés distinctifs créent une atmosphère hantée et spirituelle."
    },
    "Double Harmonic": {
      "name": "Double Harmonic",
      "description": "Gamme exotique avec deux secondes augmentées : 1-♭2-3-4-5-♭6-7 (identique à Bhairav). \"Double\" fait référence aux secondes augmentées entre ♭2-3 et ♭6-7. Crée un caractère dramatique moyen-oriental/indien. Utilisée dans le metal, le rock progressif et la fusion world pour une saveur exotique maximale et de la tension. Son extrêmement distinctif et reconnaissable."
    },
    "Hungarian Minor": {
      "name": "Hungarian Minor",
      "description": "Mineur harmonique avec 4e élevée : 1-2-♭3-♯4-5-♭6-7. Trois secondes augmentées créent un caractère gitan exotique. Plus chromatique que le mineur harmonique. Utilisée dans la musique folklorique hongroise, le jazz manouche, la musique classique (Liszt) et le metal. Crée une atmosphère passionnée, dramatique et est-européenne. Gamme signature du jazz style Django Reinhardt."
    },
    "Neapolitan Major": {
      "name": "Neapolitan Major",
      "description": "Gamme majeure avec 2e abaissée : 1-♭2-3-4-5-6-7. Crée une gamme lumineuse avec une torsion sombre et chromatique du ♭2. Utilisée dans la musique classique (notamment la cadence napolitaine IV6 de ♭II). Le ♭2 crée une tension contre la tonique tout en maintenant le caractère majeur. Utilisée pour une couleur chromatique sophistiquée dans la musique classique et de film."
    },
    "Neapolitan Minor": {
      "name": "Neapolitan Minor",
      "description": "Mineur harmonique avec 2e abaissée : 1-♭2-♭3-4-5-♭6-7. Combine le drame du mineur harmonique avec le ♭2 phrygien. Deux secondes augmentées créent une tension extrême. Caractère très sombre et exotique. Utilisée dans la musique classique pour des passages dramatiques et sinistres. Plus intense et chromatique que le mineur harmonique. Crée une atmosphère inquiétante et menaçante."
    },
    "Enigmatic": {
      "name": "Enigmatic",
      "description": "Gamme synthétique rare : 1-♭2-3-♯4-♯5-♯6-7. Plusieurs degrés élevés créent une ambiguïté à la manière de la gamme par tons avec tension chromatique. Popularisée par Verdi. Extrêmement instable - difficile d'établir une tonalité. Utilisée pour des passages mystérieux, surréels et non résolus. L'une des gammes traditionnelles les plus dissonantes et ambiguës. Crée un caractère vraiment énigmatique."
    },
    "Phrygian Dominant": {
      "name": "Phrygian Dominant",
      "description": "Cinquième mode du mineur harmonique : 1-♭2-3-4-5-♭6-♭7 (identique à Maqam Hijaz). Combine le ♭2 phrygien avec la tierce majeure. La seconde augmentée entre ♭2 et 3 crée le son espagnol/moyen-oriental distinctif. Fondement de la musique flamenco. Utilisé dans le metal, le rock progressif et la world music pour une saveur exotique et dramatique. Son instantanément reconnaissable."
    },
    "Persian": {
      "name": "Persian",
      "description": "Gamme exotique approximant la musique persane : 1-♭2-3-4-♭5-♭6-7. Combine le ♭2 phrygien, la tierce majeure, la quinte diminuée et la 7e majeure. Plusieurs intervalles augmentés et diminués créent un caractère complexe et tendu. Utilisée pour une saveur moyen-orientale avec chromatisme supplémentaire. Crée une atmosphère mystérieuse, ancienne et exotique au-delà du Phrygien Dominant standard."
    },
    "Hirajoshi": {
      "name": "Hirajoshi",
      "description": "Gamme pentatonique japonaise : 1-2-♭3-5-♭6. Gamme à cinq notes sans quinte juste. Crée un caractère distinctement japonais - ni purement majeur ni mineur. Utilisée dans la musique traditionnelle japonaise et les compositions modernes recherchant une saveur japonaise. Les intervalles uniques créent une atmosphère paisible, contemplative et exotique. Son signature du koto et shamisen."
    },
    "Insen": {
      "name": "Insen",
      "description": "Gamme pentatonique japonaise : 1-♭2-4-5-♭7. Caractère mineur sombre avec ♭2 phrygien. Crée une atmosphère japonaise mélancolique. Utilisée dans la musique traditionnelle japonaise et les bandes sonores modernes. Le ♭2 donne un côté exotique à la structure pentatonique mineure. Évoque le Japon ancien, la méditation et l'introspection. Populaire dans la musique de jeux vidéo et d'anime."
    },
    "Kumoi": {
      "name": "Kumoi",
      "description": "Gamme pentatonique japonaise : 1-2-♭3-5-6. Pentatonique mineure avec 6e naturelle. Plus lumineuse que la pentatonique mineure standard, plus sombre que la pentatonique majeure. Crée un caractère japonais doux. Utilisée dans la musique traditionnelle et les chansons folkloriques. La 6e majeure apporte un éclat dans un contexte mineur. Évoque la beauté naturelle et les paysages japonais pastoraux."
    },
    "Egyptian Pentatonic": {
      "name": "Egyptian Pentatonic",
      "description": "Pentatonique suspendue ancienne : 1-2-4-5-♭7. Pas de tierce, crée un caractère suspendu et ambigu. Utilisée dans la musique égyptienne antique (reconstruction théorique) et la musique folklorique moyen-orientale. Similaire à la pentatonique mineure mais avec une 2e majeure au lieu de ♭3. Crée une atmosphère neutre, ancienne et intemporelle. Populaire pour la world music et la fusion ethnique."
    }
  },
  "progressionCategories": {
    "Pop/Rock": "Pop/Rock",
    "Blues/Soul": "Blues/Soul",
    "Jazz/Functional": "Jazz/Fonctionnel",
    "Classical/Modal": "Classique/Modal",
    "Electronic/Modern": "Électronique/Moderne",
    "R&B/Neo-Soul": "R&B/Neo-Soul",
    "Gospel/Worship": "Gospel/Louange",
    "Hip-Hop/Trap": "Hip-Hop/Trap",
    "Latin/Bossa": "Latin/Bossa",
    "Film/Cinematic": "Film/Cinématique",
    "Folk/Singer-Songwriter": "Folk/Auteur-Compositeur",
    "Metal/Rock": "Metal/Rock",
    "Trance/Psytrance/Goa": "Trance/Psytrance/Goa",
    "Jungle/Drum'n'Bass": "Jungle/Drum'n'Bass",
    "Italo-Disco/House": "Italo-Disco/House",
    "Synthwave/Retrowave": "Synthwave/Retrowave",
    "African Dance": "Danse Africaine",
    "UK Bass": "UK Bass",
    "Reggae/Dub": "Reggae/Dub",
    "Acid/EBM": "Acid/EBM"
  },
  "progressions": {
    "Pop/Rock": {
      "I—V—vi—IV": {
        "name": "I—V—vi—IV",
        "nickname": "Axis of Awesome",
        "description": "La progression la plus populaire dans la pop moderne. La tonique vers la dominante crée un mouvement vers l'avant, la résolution trompeuse vers vi ajoute de l'émotion, IV fournit un retour doux. Utilisée dans des centaines de tubes de \"Let It Be\" à \"Don't Stop Believin'.\""
      },
      "I—IV—V—I": {
        "name": "I—IV—V—I",
        "nickname": "Classic Rock",
        "description": "Le fondement du rock and roll. Passe de la tonique par la sous-dominante à la dominante, créant tension et résolution satisfaisantes. L'épine dorsale du blues, de la country et du rock primitif de Chuck Berry aux Beatles."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Pop Punk",
        "description": "Commence sur le mineur relatif pour un impact émotionnel immédiat, puis cycle par sous-dominante, tonique et dominante. Crée une sensation anthémique, à chanter ensemble. Popularisée par des groupes comme Blink-182 et Green Day."
      },
      "I—vi—IV—V": {
        "name": "I—vi—IV—V",
        "nickname": "50s Doo-Wop",
        "description": "Les changements classiques \"doo-wop\" des groupes vocaux des années 1950. La tonique vers le mineur relatif crée une mélancolie douce, sous-dominante et dominante complètent le cercle. Pensez à \"Stand By Me\" ou \"Blue Moon.\""
      },
      "I—V—vi—iii—IV": {
        "name": "I—V—vi—iii—IV",
        "nickname": "Canon Progression",
        "description": "Séquence du Canon de Pachelbel étendue. Descend à travers la gamme, créant un momentum vers l'avant inévitable. Utilisée dans \"Basket Case,\" \"Hook,\" d'innombrables ballades. L'accord iii ajoute une complexité romantique."
      },
      "IV—I—V—vi": {
        "name": "IV—I—V—vi",
        "nickname": "Despacito",
        "description": "Commence avec la sous-dominante pour un élan immédiat, résout à la tonique, puis passe par la dominante au mineur relatif. Crée une sensation circulaire et hypnotique parfaite pour la pop latine et les grooves reggaeton."
      },
      "vi—V—IV—V": {
        "name": "vi—V—IV—V",
        "nickname": "Grenade",
        "description": "La tonique mineure vers la dominante crée une tension dramatique, la sous-dominante offre un bref répit avant que la dominante ne construise à nouveau. Parfait pour les power ballads et les apogées émotionnelles comme \"Grenade\" de Bruno Mars."
      },
      "I—III—IV—iv": {
        "name": "I—III—IV—iv",
        "nickname": "Creep",
        "description": "Rendu célèbre par Radiohead. La tonique majeure vers III majeur est inattendu, IV est familier, puis iv (emprunté au mineur) ajoute une mélancolie hantée. Le mouvement chromatique de la basse crée une sensation descendante distinctive."
      },
      "I—V—♭VII—IV": {
        "name": "I—V—♭VII—IV",
        "nickname": "Sweet Home",
        "description": "La saveur mixolydienne du ♭VII emprunté crée un son rock sudiste bluesy. La sous-dominante majeure après la septième bémol fournit un élan satisfaisant. Iconique dans \"Sweet Home Alabama\" et les hymnes rock classiques."
      },
      "I—♭VII—IV—I": {
        "name": "I—♭VII—IV—I",
        "nickname": "Mixolydian Vamp",
        "description": "Progression mixolydienne circulaire. Le ♭VII emprunté du parallèle mineur ajoute un côté rock, IV vers I fournit une cadence parfaite traditionnelle. Crée une sensation rock modale entraînante sans accord de dominante V."
      }
    },
    "Blues/Soul": {
      "I—I—I—I—IV—IV—I—I—V—IV—I—V": {
        "name": "I—I—I—I—IV—IV—I—I—V—IV—I—V",
        "nickname": "12-Bar Blues",
        "description": "Le fondement du blues, du rock et du jazz. Quatre mesures de tonique établissent la maison, l'accord IV crée la tension, le retour à I fournit le soulagement, V-IV crée le \"retournement\" vers I. La progression la plus importante dans la musique américaine."
      },
      "I—vi—ii—V": {
        "name": "I—vi—ii—V",
        "nickname": "Turnaround",
        "description": "Retournement jazz classique. Descend de I par le mineur relatif (vi), puis ii-V crée une forte attraction vers I. Utilisé à la fin du blues de 12 mesures et dans d'innombrables standards de jazz pour revenir en douceur au début."
      },
      "ii—V—I—VI": {
        "name": "ii—V—I—VI",
        "nickname": "Rhythm Changes A",
        "description": "De \"I Got Rhythm\" de Gershwin, les changements d'accords les plus courants dans le jazz après le blues. Le ii-V-I est la résolution la plus forte dans l'harmonie fonctionnelle, VI crée un mouvement chromatique et mène au cycle suivant."
      },
      "I—VI—ii—V": {
        "name": "I—VI—ii—V",
        "nickname": "I Got Rhythm",
        "description": "Une autre variation des rhythm changes. I vers VI (accord majeur sur le sixième degré de la gamme) crée un mouvement chromatique de basse, puis ii-V prépare le retour à I. L'accord VI est souvent joué comme V7/ii, créant un mouvement vers l'avant encore plus fort."
      },
      "i—♭III—♭VII—IV": {
        "name": "i—♭III—♭VII—IV",
        "nickname": "Dorian Vamp",
        "description": "Blues modal en mode Dorien. La tonique mineure vers ♭III majeur crée un élan optimiste, ♭VII ajoute une saveur bluesy, IV (majeur en Dorien) apporte de la luminosité. Crée un son blues mineur sophistiqué popularisé par Miles Davis et le jazz modal."
      },
      "i—IV—i—V": {
        "name": "i—IV—i—V",
        "nickname": "Minor Blues",
        "description": "La progression blues mineure. La tonique mineure vers IV majeur crée un changement dramatique, le retour à i établit la tonalité mineure, V majeur crée une tension implorant la résolution. Plus dramatique et mélancolique que le blues majeur standard."
      }
    },
    "Jazz/Functional": {
      "ii—V—I": {
        "name": "ii—V—I",
        "nickname": "2-5-1",
        "description": "La progression la plus fondamentale du jazz. Le ii (sus-tonique) prépare le V (dominante), qui résout fortement vers I (tonique). Ce mouvement de cercle des quintes est le bloc de construction de l'harmonie fonctionnelle et apparaît dans presque tous les standards de jazz."
      },
      "ii—V—I—vi": {
        "name": "ii—V—I—vi",
        "nickname": "Jazz Standard",
        "description": "Cadence ii-V-I étendue avec résolution trompeuse. Après le fort ii-V-I, l'accord vi surprend l'oreille au lieu de rester sur I, créant un momentum continu vers l'avant. Parfait pour les boucles dans les improvisations et standards de jazz."
      },
      "iii—vi—ii—V": {
        "name": "iii—vi—ii—V",
        "nickname": "Circle Progression",
        "description": "Cercle de quintes descendant : iii vers vi vers ii vers V. Chaque accord est une quinte en dessous du précédent, créant une attraction gravitationnelle inévitable vers la tonique. Démontre l'harmonie fonctionnelle pure en action - utilisée abondamment dans le bebop et le hard bop."
      },
      "IVM7—V7—iii7—vi": {
        "name": "IVM7—V7—iii7—vi",
        "nickname": "Fly Me To The Moon",
        "description": "Du standard de jazz de Bart Howard. IV-V crée un mouvement fort, iii-vi continue en descendant par tierces (cascade plagale). Les riches voicings maj7 et dom7 créent un son jazz sophistiqué et romantique parfait pour les ballades."
      },
      "IM7—ii7—iii7—IVM7": {
        "name": "IM7—ii7—iii7—IVM7",
        "nickname": "Ascending Jazz",
        "description": "Progression ascendante par degrés à travers les accords de 7e diatoniques. Crée un mouvement doux et élevant. Évite les résolutions fonctionnelles fortes, peignant plutôt avec couleur et texture. Courant dans le jazz modal et les compositions de jazz contemporain."
      },
      "vi—ii—V—I": {
        "name": "vi—ii—V—I",
        "nickname": "Minor Turnaround",
        "description": "Commence sur le mineur relatif (vi) pour un départ émotionnel plus sombre, puis cycle à travers ii-V-I pour résoudre vers la tonique majeure. Le contraste entre le début mineur et la résolution majeure crée un arc émotionnel satisfaisant courant dans les ballades jazz."
      },
      "I—vi—IV—♯iv°—V": {
        "name": "I—vi—IV—♯iv°—V",
        "nickname": "Chromatic Turnaround",
        "description": "Retournement classique avec accord diminué de passage. Le ♯iv° (quatre augmenté diminué) crée une ligne de basse chromatique (I-vi-IV-♯iv°-V), ajoutant sophistication harmonique. L'accord diminué fonctionne comme dominante de la dominante, renforçant la résolution vers V."
      },
      "iv—♭VII—I": {
        "name": "iv—♭VII—I",
        "nickname": "Backdoor",
        "description": "La \"progression backdoor\" - approche la tonique depuis ♭VII au lieu de V. Le iv emprunté du parallèle mineur ajoute de la couleur, ♭VII crée une résolution d'un ton entier vers I (mouvement plagal). Apporte un soulagement du constant ii-V-I, ajoute une fraîcheur inattendue à l'harmonie jazz."
      },
      "I—♯I°—ii—♯II°": {
        "name": "I—♯I°—ii—♯II°",
        "nickname": "Chromatic Walk",
        "description": "Ligne de basse ascendante chromatique utilisant des accords diminués de passage. Chaque accord diminué connecte des accords diatoniques séparés d'un ton entier. Crée une conduite des voix douce et un son sophistiqué utilisé dans les intros et interludes jazz."
      },
      "IM7—♭IIIM7—♭VIM7—♭II7": {
        "name": "IM7—♭IIIM7—♭VIM7—♭II7",
        "nickname": "Giant Steps",
        "description": "Les changements révolutionnaires \"Giant Steps\" de John Coltrane. Se déplace à travers trois centres tonaux divisés en tierces majeures (I, ♭III, ♭VI). Le ♭II7 est une substitution tritonique. Crée un mouvement harmonique maximal, moment déterminant dans l'évolution du jazz."
      }
    },
    "Classical/Modal": {
      "I—IV—vii°—iii—vi—ii—V—I": {
        "name": "I—IV—vii°—iii—vi—ii—V—I",
        "nickname": "Circle of Fifths",
        "description": "Progression complète du cercle des quintes. Chaque fondamentale d'accord descend d'une quinte juste (ou monte d'une quarte juste), démontrant l'attraction gravitationnelle de l'harmonie fonctionnelle. Progression pédagogique fondamentale montrant comment tous les accords diatoniques se relient."
      },
      "I—V—vi—iii—IV—I—IV—V": {
        "name": "I—V—vi—iii—IV—I—IV—V",
        "nickname": "Pachelbel Canon",
        "description": "La célèbre progression du Canon en Ré de Johann Pachelbel. La ligne de basse descendante par degrés crée une conduite des voix élégante. La séquence est devenue un cliché par surutilisation mais reste pédagogiquement précieuse pour enseigner le contrepoint baroque et la technique de basse obstinée."
      },
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Andalusian",
        "description": "La \"cadence andalouse\" du mode Phrygien. Le tétracorde descendant (motif de quatre notes) crée un caractère tragique espagnol. Tonique mineure vers ♭VII et ♭VI empruntés, se terminant sur V majeur. Utilisée dans le flamenco, la musique classique et de film pour une saveur méditerranéenne."
      },
      "i—♭VII—i—V": {
        "name": "i—♭VII—i—V",
        "nickname": "Passamezzo Antico",
        "description": "Progression de danse Renaissance, \"vieux passamezzo\". La tonique mineure vers ♭VII emprunté crée une ambiguïté modale, le retour à i confirme le mineur, V majeur fournit la tension. Exemple précoce d'harmonie mineure i-V précédant la période de pratique courante."
      },
      "I—V—I—IV": {
        "name": "I—V—I—IV",
        "nickname": "Passamezzo Moderno",
        "description": "\"Passamezzo moderne\" de la Renaissance - la version majeure. Assertion tonique-dominante, retour à la tonique, puis sous-dominante. Progression de danse simple mais efficace en mode majeur. Montre l'évolution de la pensée modale vers tonale au début de la période baroque."
      },
      "iv—♭VII—♭III—♭VI": {
        "name": "iv—♭VII—♭III—♭VI",
        "nickname": "Plagal Cascade",
        "description": "Mouvement plagal (sous-dominant) descendant à travers des accords empruntés. Pas de dominante présente - toutes résolutions \"douces\". Crée une atmosphère modale sombre évitant les cadences fonctionnelles V-I. Populaire dans les musiques de film et le rock progressif pour une qualité ambiguë et dérivante."
      },
      "i—iv—♭VII—♭III": {
        "name": "i—iv—♭VII—♭III",
        "nickname": "Natural Minor",
        "description": "Progression en mineur naturel pur (mode Éolien) utilisant des accords diatoniques. La tonique et sous-dominante mineures établissent la sensation mineure, ♭VII et ♭III sont caractéristiques du mineur naturel versus mineur harmonique. Crée une atmosphère mélancolique et modale sans résolution de sensible."
      }
    },
    "Electronic/Modern": {
      "i—♭VI—♭III—♭VII": {
        "name": "i—♭VI—♭III—♭VII",
        "nickname": "EDM Drop",
        "description": "La progression du \"drop\" dans l'EDM moderne. La tonique mineure vers ♭VI emprunté crée un élan immédiat, ♭III ajoute une couleur optimiste, ♭VII fournit une énergie mixolydienne entraînante. Évite la dominante V pour une boucle hypnotique non-fonctionnelle. Parfait pour les montées et les bass drops."
      },
      "i—♭VII—♭VI—♭VII": {
        "name": "i—♭VII—♭VI—♭VII",
        "nickname": "Dark House",
        "description": "Progression house mineure sombre. Les ♭VII et ♭VI empruntés du parallèle majeur créent une ambiguïté modale, évitant l'harmonie mineure traditionnelle. Le ♭VII oscille, créant tension sans résolution. Utilisée dans la tech house et la progressive house sombre pour une atmosphère menaçante."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Pop Loop",
        "description": "Optimisée pour le bouclage électronique. Commence sur le mineur relatif pour une émotion immédiate, cycle à travers des changements pop familiers mais se termine sur V au lieu de IV, créant une attraction plus forte vers le début. Parfait pour des boucles de 4 mesures sans couture dans la pop électronique et la future bass."
      },
      "I—V—vi—IV—I—V—iii—IV": {
        "name": "I—V—vi—IV—I—V—iii—IV",
        "nickname": "Extended Pop",
        "description": "Progression pop étendue de huit mesures. Les quatre premières mesures sont le classique \"Axis of Awesome\" I-V-vi-IV, les quatre secondes substituent iii à vi, créant une variation tout en maintenant la familiarité. Permet des montées plus longues et des arrangements plus complexes dans la production pop électronique."
      },
      "i—♭III—♭VII—i": {
        "name": "i—♭III—♭VII—i",
        "nickname": "Modal Interchange",
        "description": "Démontre le concept d'échange modal. Tous les accords empruntés du parallèle majeur (♭III, ♭VII) mélangés avec i mineur naturel. Crée une tonalité moderne et ambiguë évitant la résolution traditionnelle V-i. Pierre angulaire de l'harmonie de la musique électronique contemporaine, du synthwave à la future bass."
      },
      "I—♭III—IV—♭VI": {
        "name": "I—♭III—IV—♭VI",
        "nickname": "Chromatic Mediant",
        "description": "Explore les relations de médiantes chromatiques. I vers ♭III est un changement dramatique (fondamentales séparées d'une tierce majeure, pas dans la tonalité), IV est familier, ♭VI est une autre médiante chromatique. Crée un mouvement harmonique cinématographique et inattendu. Utilisée dans la progressive house et le melodic dubstep pour impact émotionnel."
      },
      "i—iv—v": {
        "name": "i—iv—v",
        "nickname": "Techno Minimal",
        "description": "Palette mécanique épurée. Triades mineures et voicings quartaux pour des boucles hypnotiques."
      },
      "I—IV—V": {
        "name": "I—IV—V",
        "nickname": "Deep House",
        "description": "Palette chaleureuse et jazzy. Riches accords de 7e pour des vibes deep house souful et groovy."
      },
      "IM7—IVM7—VM7": {
        "name": "IM7—IVM7—VM7",
        "nickname": "Ambient Wash",
        "description": "Palette ouverte et flottante. 7es majeures/mineures et voicings quartaux pour des paysages sonores éthérés."
      }
    },
    "R&B/Neo-Soul": {
      "ii—V—IM7—vi": {
        "name": "ii—V—IM7—vi",
        "nickname": "Neo-Soul Standard",
        "description": "Changements neo-soul influencés par le jazz. S'ouvre avec ii-V emprunté au jazz, résout vers IM7 (pas I simple) pour une couleur sophistiquée, l'accord vi trompeur ajoute de la mélancolie. Voicings d'accords de 7e riches essentiels. Définit le son de D'Angelo, Erykah Badu et le R&B moderne."
      },
      "IM7—iii7—vi7—ii7": {
        "name": "IM7—iii7—vi7—ii7",
        "nickname": "Smooth R&B",
        "description": "Accords de 7e diatoniques descendants créent un son luxuriant et sophistiqué. Toutes 7es majeures et mineures, pas de tension dominante - qualité douce et flottante. Descend par tierces puis quartes, créant un mouvement vers l'avant doux. Parfait pour les slow jams et les ballades R&B contemporaines."
      },
      "I—IV—ii—V": {
        "name": "I—IV—ii—V",
        "nickname": "Classic R&B",
        "description": "Combine la simplicité pop avec la sophistication jazz. I-IV est un mouvement plagal familier, ii-V est une cadence jazz classique. L'accord ii transforme le familier I-IV-V en quelque chose de plus raffiné. Fondement de Motown, Stax et de la soul classique des années 60 et 70."
      },
      "vi—ii—iii—IV": {
        "name": "vi—ii—iii—IV",
        "nickname": "Emotional Ballad",
        "description": "Commence sur le mineur relatif pour une vulnérabilité immédiate, monte à travers ii et iii (tension croissante), résout vers IV (sous-dominante). Évite les accords évidents I et V, créant un arc émotionnel sophistiqué. Courant dans les ballades R&B modernes et neo-soul, permet la liberté mélodique."
      },
      "IM7—V7/IV—IVM7—iv": {
        "name": "IM7—V7/IV—IVM7—iv",
        "nickname": "Chromatic Soul",
        "description": "Harmonie chromatique avancée. V7/IV est une dominante secondaire (dominante de IV), créant une tonicisation temporaire. IV majeur vers iv mineur est un changement chromatique emprunté du parallèle mineur. Crée une conduite des voix sophistiquée et une couleur harmonique caractéristique de Stevie Wonder et du neo-soul moderne."
      },
      "i—iv—♭VII—♭VI": {
        "name": "i—iv—♭VII—♭VI",
        "nickname": "Minor Soul",
        "description": "Progression R&B en mode mineur. Le i-iv mineur naturel établit une fondation sombre, ♭VII et ♭VI empruntés du Dorien/Éolien créent une ambiguïté modale. Le mouvement plagal descendant évite la résolution dominante. Utilisé dans le R&B contemporain pour une atmosphère plus sombre et mélancolique."
      },
      "I—♯iv°—ii—V": {
        "name": "I—♯iv°—ii—V",
        "nickname": "Gospel Soul",
        "description": "Accord de passage chromatique influencé par le gospel. Le ♯iv° (quatre augmenté diminué) crée une ligne de basse chromatique douce connectant I à ii, puis cadence classique ii-V. L'accord diminué fonctionne comme dominante de la dominante, ajoutant une sophistication harmonique empruntée à la tradition de l'église noire."
      }
    },
    "Gospel/Worship": {
      "I—V/ii—ii—V": {
        "name": "I—V/ii—ii—V",
        "nickname": "Gospel Turnaround",
        "description": "Retournement gospel classique avec dominante secondaire. V/ii (dominante de ii) crée une approche chromatique de l'accord ii, puis cadence traditionnelle ii-V vers I. La dominante secondaire ajoute sophistication harmonique et momentum vers l'avant caractéristiques de la musique d'église noire et du gospel traditionnel."
      },
      "IV—V—iii—vi": {
        "name": "IV—V—iii—vi",
        "nickname": "Praise Progression",
        "description": "Progression de louange et adoration élevante. Commence sur IV (sous-dominante) pour un élan immédiat plutôt que I, V ajoute de l'énergie, descend par iii vers vi créant une résolution douce. Évite d'arriver sur I, gardant l'énergie en mouvement vers l'avant. Courant dans les refrains de louange et adoration contemporains."
      },
      "I—IV—V/vi—vi": {
        "name": "I—IV—V/vi—vi",
        "nickname": "Contemporary Worship",
        "description": "Progression d'adoration moderne avec dominante secondaire. Ouverture familière I-IV, V/vi (dominante de vi) approche chromatiquement le mineur relatif, créant une conduite des voix douce. L'arrivée sur vi ajoute introspection et émotion. Définit la musique chrétienne contemporaine de Hillsong à Bethel."
      },
      "ii—V—I—IV": {
        "name": "ii—V—I—IV",
        "nickname": "Church Cadence",
        "description": "Combine l'harmonie jazz et hymne. S'ouvre avec une forte cadence ii-V-I empruntée au jazz (courant dans le gospel), ajoute le mouvement plagal IV-I de l'hymnodie traditionnelle. Les deux types de cadence créent une double résolution satisfaisante. Fondamental au piano gospel et au jeu d'orgue Hammond."
      },
      "I—V/V—V—vi—IV": {
        "name": "I—V/V—V—vi—IV",
        "nickname": "Gospel Rock",
        "description": "Progression fusion gospel-rock. V/V (dominante de la dominante) crée une intensité chromatique approchant V, puis vi trompeur ajoute de l'émotion, IV complète le mouvement plagal. Combine le chromatisme gospel avec l'énergie rock. Utilisé dans le rock chrétien contemporain et la pop influencée par le gospel."
      },
      "IV—I—V—vi—IV—♭VII": {
        "name": "IV—I—V—vi—IV—♭VII",
        "nickname": "Extended Worship",
        "description": "Progression d'adoration étendue de six mesures. S'ouvre sur la sous-dominante pour l'élan, cycle à travers des changements familiers, ajoute ♭VII emprunté à la fin pour couleur modale et saveur mixolydienne. L'extension permet des montées mélodiques et dynamiques plus longues courantes dans la production d'adoration moderne et les contextes live."
      }
    },
    "Hip-Hop/Trap": {
      "i—♭VI—♭VII": {
        "name": "i—♭VI—♭VII",
        "nickname": "Trap Minor",
        "description": "Progression trap moderne essentielle. Tonique mineure avec ♭VI et ♭VII empruntés crée une atmosphère modale sombre. Boucle courte de trois accords parfaite pour les lignes de basse 808 et les roulements de charleston. Évite les cadences traditionnelles pour un son trap hypnotique et menaçant de Metro Boomin à Southside."
      },
      "i—♭III—♭VI—♭VII": {
        "name": "i—♭III—♭VI—♭VII",
        "nickname": "Dark Trap",
        "description": "Progression trap sombre étendue. Tous les accords empruntés du mineur naturel - ♭III ajoute un moment d'espoir avant de descendre vers ♭VI et ♭VII. Boucle de quatre accords fournit plus de mouvement harmonique tout en maintenant une atmosphère menaçante. Utilisée dans le trap mélodique et la production hip-hop sombre."
      },
      "vi—IV—I": {
        "name": "vi—IV—I",
        "nickname": "Sad Trap",
        "description": "Progression \"sad trap\" émotionnelle. Commence sur le mineur relatif pour la mélancolie, IV-I fournit une résolution familière. La simplicité de trois accords permet de se concentrer sur la mélodie et les 808. Définit l'emo-trap et le rap mélodique de Lil Peep à Juice WRLD, combinant production hip-hop avec vulnérabilité émotionnelle."
      },
      "i—♭VII—♭VI": {
        "name": "i—♭VII—♭VI",
        "nickname": "Lofi Hip-Hop",
        "description": "Progression lofi hip-hop quintessentielle. La tonique mineure descend par ♭VII emprunté vers ♭VI, créant une atmosphère mélancolique et nostalgique. L'ambiguïté modale évite la résolution fonctionnelle. Parfait pour les samples jazzy, le craquement de vinyle et les beats chill pour étudier/relaxer. Fondement de l'esthétique lofi YouTube."
      },
      "i—iv—i—♭VI": {
        "name": "i—iv—i—♭VI",
        "nickname": "Boom Bap",
        "description": "Progression hip-hop boom bap classique. Le i-iv mineur établit une humeur sombre, retour à i confirme la tonalité, ♭VI emprunté ajoute de la couleur avant la boucle. Changements simples et cycliques soutiennent la concentration sur les batteries et le sampling. Définit le hip-hop âge d'or de Premier à Pete Rock."
      },
      "i—♭III—iv—♭VI": {
        "name": "i—♭III—iv—♭VI",
        "nickname": "Emo Rap",
        "description": "Progression émotionnelle emo rap. Tonique mineure vers ♭III crée un élan optimiste, iv mineur ajoute de la vulnérabilité, ♭VI fournit une couleur mélancolique. Mélange d'accords empruntés et de mineur diatonique crée une atmosphère émotionnellement complexe. Utilisé dans l'emo rap moderne et le hip-hop alternatif pour des paroles introspectives."
      },
      "I—♭III—♭VII—IV": {
        "name": "I—♭III—♭VII—IV",
        "nickname": "West Coast",
        "description": "Progression G-funk West Coast. Tonique majeure avec ♭III chromatique (tierce majeure en dessous de la fondamentale), ♭VII ajoute une saveur funk, IV est la sous-dominante traditionnelle. Mélange de tonalité majeure avec emprunt modal crée le son décontracté influencé par Parliament de Dr. Dre, Snoop Dogg et l'ère G-funk."
      },
      "ii7—V7—IM7": {
        "name": "ii7—V7—IM7",
        "nickname": "Lofi Jazz",
        "description": "Palette jazzy et nostalgique. Tous accords de 7e, pas de triades simples - vibes chaudes, poussiéreuses et vinyle."
      },
      "i—♭VII—iv": {
        "name": "i—♭VII—iv",
        "nickname": "Footwork Juke",
        "description": "Palette frénétique de Chicago. Harmonie simple pour des rythmes hachés complexes à 160bpm."
      }
    },
    "Latin/Bossa": {
      "IM7—VI7—ii7—V7": {
        "name": "IM7—VI7—ii7—V7",
        "nickname": "Bossa Nova",
        "description": "Changements bossa nova classiques. IM7 établit une tonalité jazzy, VI7 est une dominante secondaire chromatique (dominante de ii), puis ii7-V7 traditionnel. Tous les accords de 7e créent un son brésilien sophistiqué. Le VI7-ii7 crée une conduite des voix chromatique douce. Fondement de João Gilberto et Antonio Carlos Jobim."
      },
      "i—iv—V—i": {
        "name": "i—iv—V—i",
        "nickname": "Tango",
        "description": "Progression tango argentin traditionnelle. Le i-iv mineur établit un caractère mélancolique, V majeur crée la tension (saveur de mineur harmonique), résout vers i. La résolution dramatique de mineur vers V majeur crée une qualité passionnée et désirante essentielle au tango. Pensez à Piazzolla et à la milonga traditionnelle."
      },
      "I—♭II—I—V": {
        "name": "I—♭II—I—V",
        "nickname": "Flamenco",
        "description": "Cadence phrygienne flamenco. I majeur vers ♭II crée un clash de demi-ton caractéristique (mode Phrygien), retour à I, puis V. Le ♭II est le son flamenco le plus distinctif, créant un caractère espagnol/mauresque. Utilisé dans la rumba flamenca, les bulerías et les traditions de guitare espagnole."
      },
      "i—V—i—VII": {
        "name": "i—V—i—VII",
        "nickname": "Samba",
        "description": "Progression samba brésilienne. Le i-V-i mineur établit la maison, VII majeur (du mineur naturel, pas harmonique) ajoute luminosité et mouvement vers l'avant vers i. Le VII naturel au lieu de la sensible crée un son modal, moins européen caractéristique de la musique populaire brésilienne et du pagode."
      },
      "I—V/ii—ii—V/V—V": {
        "name": "I—V/ii—ii—V/V—V",
        "nickname": "Latin Jazz",
        "description": "Progression jazz latine avancée avec doubles dominantes secondaires. V/ii approche ii chromatiquement, V/V (dominante de la dominante) intensifie l'approche vers V. Crée un mouvement harmonique maximal à travers la conduite chromatique des voix. Utilisé dans le jazz latin, la salsa et le jazz afro-cubain pour une couleur sophistiquée."
      },
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Bolero",
        "description": "Progression bolero romantique. Le i mineur avec ♭VII et ♭VI empruntés crée une descente mélancolique, puis V majeur fournit une tension dramatique. Les accords modaux empruntés combinés avec le V de mineur harmonique créent un caractère passionné. Fondement de la tradition bolero mexicaine et cubaine de Trio Los Panchos à Luis Miguel."
      }
    },
    "Film/Cinematic": {
      "I—♭VI—♭III—♭VII": {
        "name": "I—♭VI—♭III—♭VII",
        "nickname": "Epic Trailer",
        "description": "Progression trailer épique moderne. Tonique majeure avec tous les accords bémol empruntés crée un son cinématographique massif. Les médiantes chromatiques (♭VI, ♭III) fournissent des changements harmoniques dramatiques, ♭VII ajoute la puissance mixolydienne. Définit Two Steps From Hell, les trailers Hans Zimmer et le marketing de films d'action modernes."
      },
      "i—♭VI—♭VII—i": {
        "name": "i—♭VI—♭VII—i",
        "nickname": "Dark Cinematic",
        "description": "Progression de musique de film sombre et sinistre. Tonique mineure avec ♭VI et ♭VII empruntés crée une atmosphère inquiétante, retourne à i pour une tension cyclique. L'ambiguïté modale évite la résolution. Utilisée dans les musiques de thriller, d'horreur et de drame sombre pour une tension psychologique soutenue sans cadences traditionnelles."
      },
      "I—V—vi—♭VI—IV": {
        "name": "I—V—vi—♭VI—IV",
        "nickname": "Emotional Score",
        "description": "Progression orchestrale émotionnelle. Commence avec des changements pop familiers I-V-vi, puis ♭VI (médiante chromatique) crée un changement émotionnel inattendu avant que IV ne résolve. Le ♭VI est le \"twist\" - moment dramatique dans le récit. Courant dans les apogées émotionnelles, les révélations de personnages et les musiques de film romantiques."
      },
      "i—♭III—♭VII—♭VI—V": {
        "name": "i—♭III—♭VII—♭VI—V",
        "nickname": "Heroic Theme",
        "description": "Progression d'action montante héroïque. Le i mineur vers ♭III majeur crée un élan optimiste, ♭VII et ♭VI ajoutent de la couleur, V majeur (mineur harmonique) crée une résolution dramatique. Mélange d'emprunt modal et de V-i fonctionnel fournit à la fois portée épique et résolution satisfaisante. Utilisé pour les thèmes de héros et les moments triomphants."
      },
      "I—♭VII—♭VI—♭VII": {
        "name": "I—♭VII—♭VI—♭VII",
        "nickname": "Adventure",
        "description": "Progression d'aventure et d'exploration. I majeur avec ♭VII mixolydien crée un son optimiste et ouvert. Le ♭VI ajoute une couleur mystérieuse, ♭VII oscille créant un mouvement vers l'avant. Évite les accords mineurs pour une sensation d'aventure pure. Pensez à Indiana Jones, comédies d'aventure et montages d'expédition."
      },
      "i—iv—♭VI—♭III": {
        "name": "i—iv—♭VI—♭III",
        "nickname": "Suspense",
        "description": "Progression de suspense et de mystère. Le i-iv mineur établit la tension, ♭VI ajoute l'obscurité, ♭III fournit un bref espoir avant de boucler. Tous les accords empruntés/diatoniques mineurs évitent la résolution, maintenant un malaise constant. Parfait pour le travail de détective, les scènes de traque et la musique de fond de thriller psychologique."
      },
      "I—♭III—♭VI—♭II": {
        "name": "I—♭III—♭VI—♭II",
        "nickname": "Chromatic Film",
        "description": "Progression de médiantes chromatiques extrême. Toutes les fondamentales sont des médiantes chromatiques (tierces majeures ou mineures de distance). Crée une instabilité et une surprise harmoniques maximales. Le ♭II (napolitain) est particulièrement frappant. Utilisé pour des scènes surréalistes, des séquences de rêve, des ruptures psychologiques et des musiques de film d'avant-garde."
      }
    },
    "Folk/Singer-Songwriter": {
      "I—IV—I—V": {
        "name": "I—IV—I—V",
        "nickname": "Folk Standard",
        "description": "Progression folk simple et intemporelle. I-IV établit la maison, retour à I confirme la tonalité, V crée la tension pour le cycle suivant. Structure de phrase de deux mesures parfaite pour les chansons couplet-refrain. Fondement du folk américain de Woody Guthrie à Bob Dylan, met l'accent sur les paroles plutôt que la complexité harmonique."
      },
      "vi—IV—V—I": {
        "name": "vi—IV—V—I",
        "nickname": "Sad Folk",
        "description": "Progression auteur-compositeur mélancolique. Commence sur le mineur relatif pour une ouverture introspective, IV-V-I crée un arc émotionnel ascendant vers la résolution. Courant dans le folk confessionnel et indie. L'arc de la tristesse (vi) à l'espoir (I) reflète la narration narrative. Pensez à Elliott Smith, Iron & Wine."
      },
      "I—V—IV—I": {
        "name": "I—V—IV—I",
        "nickname": "Country",
        "description": "Progression country classique. I-V crée la tension, IV-I fournit une résolution de cadence plagale \"amen\". Le IV-I (sous-dominante-tonique) est plus doux que V-I, créant une sensation country chaleureuse et familière. Fondement de la country traditionnelle, du bluegrass et du honky-tonk de Hank Williams à Nashville moderne."
      },
      "I—iii—IV—V": {
        "name": "I—iii—IV—V",
        "nickname": "Classic Folk",
        "description": "Progression folk ascendante. I vers iii crée un mouvement ascendant doux (relation de médiante), IV-V continue l'ascension vers I. Tous les accords diatoniques créent un son pur et consonant. L'accord iii ajoute de la sophistication au-delà du simple I-IV-V. Utilisé dans les ballades folk traditionnelles et les classiques auteur-compositeur."
      },
      "IV—V—I—vi": {
        "name": "IV—V—I—vi",
        "nickname": "Americana",
        "description": "Progression roots americana. Commence sur IV (sous-dominante) pour une sensation ouverte et nostalgique, V-I fournit une cadence forte, vi trompeur ajoute de la mélancolie avant la boucle. Mélange d'optimisme (IV-V-I) et de tristesse (vi) capture le caractère americana doux-amer. Courant dans l'alt-country et l'americana de Wilco à Jason Isbell."
      },
      "I—V—vi—iii": {
        "name": "I—V—vi—iii",
        "nickname": "Irish Folk",
        "description": "Progression folk celtique. Ouverture familière I-V, descend vers vi puis iii. Évite l'accord IV, créant une couleur différente des progressions pop typiques. Le motif de tierces descendantes (V-vi, vi-iii) crée un mouvement mélodique fluide caractéristique des ballades irlandaises et des traditions musicales celtiques."
      },
      "I—V—vi—IV": {
        "name": "I—V—vi—IV",
        "nickname": "Post-Rock Build",
        "description": "Palette ouverte et évolutive. Accords majeurs, voicings quartaux, maj7 pour des montées texturales."
      }
    },
    "Metal/Rock": {
      "i—♭VI—♭VII—i": {
        "name": "i—♭VI—♭VII—i",
        "nickname": "Power Metal",
        "description": "Progression power metal classique. Le i mineur naturel avec ♭VI et ♭VII empruntés, retourne à i pour le cycle. Tous power chords (pas de tierces) créent une qualité majeure/mineure ambiguë. Sensation entraînante et anthémique parfaite pour les rythmes galopants. Fondement d'Iron Maiden, Helloween et du power metal européen."
      },
      "i—♭III—♭VI—♭VII": {
        "name": "i—♭III—♭VI—♭VII",
        "nickname": "Doom Metal",
        "description": "Progression doom metal descendante. Le i mineur vers ♭III majeur crée un bref espoir, descend par ♭VI vers ♭VII, évitant la résolution. Tempo lent et écrasant met l'accent sur l'obscurité modale. Tous les accords empruntés/mineur naturel créent une atmosphère oppressante. Caractéristique de Black Sabbath et de la tradition doom metal."
      },
      "i—v—♭VII—iv": {
        "name": "i—v—♭VII—iv",
        "nickname": "Prog Metal",
        "description": "Progression metal progressif. Le i et v mineurs (v mineur naturel, pas V majeur) établissent un son modal, ♭VII ajoute de la couleur, iv mineur crée un mouvement plagal. Évite la résolution traditionnelle V-i pour une harmonie plus sophistiquée et modale. Utilisé dans le prog metal et le djent pour une tonalité complexe et ambiguë."
      },
      "i—♭II—i": {
        "name": "i—♭II—i",
        "nickname": "Thrash",
        "description": "Progression thrash metal agressive. Le i mineur vers ♭II napolitain crée un clash de demi-ton et une tension extrême, retourne à i. Caractère chromatique et dissonant parfait pour des tempos rapides et des riffs agressifs. Le ♭II fournit une obscurité maximale. Caractéristique de Slayer, Metallica et de l'intensité thrash metal."
      },
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Melodic Metal",
        "description": "Progression metal mélodique avec résolution de mineur harmonique. Descend par ♭VII et ♭VI empruntés, se termine sur V majeur (du mineur harmonique) créant une forte attraction vers i. Combine couleur modale avec cadence fonctionnelle. Utilisé dans le melodic death metal et le metal néoclassique pour un son dramatique influencé par le classique européen."
      },
      "i—iv—v—i": {
        "name": "i—iv—v—i",
        "nickname": "Minor Rock",
        "description": "Progression rock en mineur naturel pur. Le i-iv-v mineur (tous mineurs/diminués de la gamme mineure naturelle) évite le V majeur du mineur harmonique. Crée un son plus sombre et plus modal que le mineur classique. Le v mineur naturel au lieu de V réduit la tension, créant une atmosphère plus lourde et moins résolue pour le heavy rock et le metal."
      }
    },
    "Trance/Psytrance/Goa": {
      "i—♭VII—i—♭VI": {
        "name": "i—♭VII—i—♭VI",
        "nickname": "Classic Goa",
        "description": "Progression Goa trance quintessentielle. Le i mineur oscille avec ♭VII et ♭VI empruntés, créant une atmosphère modale hypnotique. Évite la résolution fonctionnelle, mettant l'accent sur la qualité cyclique et méditative. Les accords empruntés du mineur naturel créent le caractère psychédélique. Fondement de la Goa trance primitive de Goa Gil à Astral Projection."
      },
      "i—♭II—♭VII—i": {
        "name": "i—♭II—♭VII—i",
        "nickname": "Phrygian Dominant",
        "description": "Progression de gamme Phrygien Dominant exotique. Le i mineur vers ♭II (napolitain) crée un caractère moyen-oriental/indien, ♭VII ajoute une couleur modale, retourne à i. Le clash de demi-ton ♭II crée une atmosphère mystique et spirituelle parfaite pour la trance psychédélique. Utilisé dans la psytrance pour un son ethnique et transcendant."
      },
      "i—V—♭VI—♭VII": {
        "name": "i—V—♭VI—♭VII",
        "nickname": "Uplifting Trance",
        "description": "Arc émotionnel uplifting trance. Le i mineur vers V majeur (mineur harmonique) crée l'espoir, puis ♭VI et ♭VII ajoutent une couleur modale avant de cycler. Mélange de V fonctionnel et d'emprunt modal crée un élan et une libération euphoriques. Définit l'uplifting trance d'Armin van Buuren à Above & Beyond pour les pics émotionnels et les breakdowns."
      },
      "i—iv—VII—III": {
        "name": "i—iv—VII—III",
        "nickname": "Harmonic Minor Psy",
        "description": "Progression psytrance en mineur harmonique pur. Utilise exclusivement la gamme mineure harmonique - i, iv, VII majeur, III majeur. La 7e élevée crée un intervalle de seconde augmentée exotique. Caractère dramatique est-européen. Le VII et III majeurs créent un mouvement ascendant lumineux contre la tonique mineure sombre pour un contraste psychédélique."
      },
      "i—♭VI—III—VII": {
        "name": "i—♭VI—III—VII",
        "nickname": "Dark Psy",
        "description": "Progression dark psytrance mélangeant les modes. Le i mineur et ♭VI du mineur naturel, III et VII majeurs du mineur harmonique. Crée une ambiguïté et une tension harmoniques maximales. L'ascension de ♭VI par III vers VII construit l'intensité. Utilisé dans la dark psy et la forest trance pour une atmosphère sinistre et alien."
      },
      "i—♭III—♭VI—V": {
        "name": "i—♭III—♭VI—V",
        "nickname": "Progressive Psy",
        "description": "Psytrance progressive avec résolution fonctionnelle. Les ♭III et ♭VI empruntés du mineur naturel créent une couleur modale, V majeur (mineur harmonique) fournit une forte attraction vers i. Combine son modal psychédélique avec résolution satisfaisante. Utilisé dans la psytrance progressive pour des montées et des libérations structurées."
      },
      "i—VII—VI—VII": {
        "name": "i—VII—VI—VII",
        "nickname": "Full-On",
        "description": "Full-on psytrance avec luminosité de mineur harmonique. Le i mineur contraste avec VII et VI majeurs (du mineur harmonique), VII oscille pour une énergie entraînante. Les accords majeurs créent un caractère énergique et élevant malgré la tonique mineure. Caractéristique du son agressif et euphorique de la full-on psytrance à 140-148 BPM."
      },
      "i—♭II—VII—V": {
        "name": "i—♭II—VII—V",
        "nickname": "Goa Classic",
        "description": "Goa trance classique avec gammes exotiques. Le i mineur vers ♭II (couleur phrygienne), VII et V majeurs du mineur harmonique. Mélange de Phrygien et mineur harmonique crée un son complexe influencé par l'Orient. Les intervalles chromatiques et exotiques créent le caractère spirituel et psychédélique de la scène Goa trance originale."
      },
      "i—iv—i—VII": {
        "name": "i—iv—i—VII",
        "nickname": "Forest Psy",
        "description": "Progression forest psytrance organique. Le simple i-iv établit le caractère mineur, retour à i, VII majeur (mineur harmonique) ajoute de la luminosité. Changements d'accords minimaux concentrent l'attention sur les textures organiques et les rythmes complexes. Crée une atmosphère terrestre et naturelle caractéristique de la forest psytrance et des styles psy minimaux plus sombres."
      },
      "i—III—VII—IV": {
        "name": "i—III—VII—IV",
        "nickname": "Morning Trance",
        "description": "Progression psytrance matinale lumineuse. Le i mineur contraste avec III, VII et IV majeurs (du mélange mineur harmonique/Dorien). Les accords majeurs créent une énergie optimiste de lever de soleil. Mouvement ascendant (i-III-VII) puis résolution vers IV crée un arc élevant. Utilisé dans les sets de psytrance matinaux pour une atmosphère positive et énergique au lever du soleil."
      },
      "i—v—♭VII": {
        "name": "i—v—♭VII",
        "nickname": "Minimal Trance",
        "description": "Palette hypnotique et entraînante. Triades mineures et majeures avec 7es pour des boucles répétitives."
      }
    },
    "Jungle/Drum'n'Bass": {
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Liquid DnB",
        "description": "Progression liquid drum and bass. Descend par ♭VII et ♭VI empruntés, résout avec V majeur (mineur harmonique). Crée une atmosphère émotionnelle et mélodique sur des breakbeats rapides. La résolution fonctionnelle V-i fournit une clôture satisfaisante malgré les accords sombres. Définit le liquid funk et le DnB atmosphérique pour un caractère soul et jazzy."
      },
      "i—♭III—♭VII—iv": {
        "name": "i—♭III—♭VII—iv",
        "nickname": "Neurofunk",
        "description": "Progression neurofunk sombre. Le i mineur vers ♭III crée un changement chromatique, ♭VII et iv mineur ajoutent une obscurité modale. Évite le V majeur pour une atmosphère non résolue et mécanique. Crée un son sci-fi dystopique sur des lignes de basse reece complexes. Caractéristique du neurofunk et du tech step DnB de Noisia à Phace pour un son agressif et futuriste."
      },
      "i—v—♭VII—iv": {
        "name": "i—v—♭VII—iv",
        "nickname": "Jump-Up",
        "description": "Progression jump-up drum and bass. Tous les accords mineurs/diminués du mineur naturel - i, v (pas V majeur), ♭VII, iv. Crée un caractère de ligne de basse rebondissante et roulante. Évite la résolution pour une énergie continue. Harmonie simple et fonctionnelle soutient la concentration sur les wobbles de basse et les samples ragga dans les styles jump-up et roller DnB."
      },
      "ii7—V7—IM7—vi7": {
        "name": "ii7—V7—IM7—vi7",
        "nickname": "Jazzstep",
        "description": "Drum and bass intelligent influencé par le jazz. Progression jazz classique ii7-V7-IM7 avec vi7 trompeur. Tous les accords de 7e créent un son sophistiqué et atmosphérique. L'harmonie jazz sur des breakbeats rapides définit le DnB intelligent et le jazzstep. Utilisé par LTJ Bukem, Calibre et les producteurs de jungle atmosphérique pour une approche raffinée et musicale à 170+ BPM."
      }
    },
    "Italo-Disco/House": {
      "I—vi—IV—V": {
        "name": "I—vi—IV—V",
        "nickname": "Classic Italo",
        "description": "Progression doo-wop des années 1950 réutilisée pour l'Italo disco. I-vi crée une mélancolie douce, IV-V complète le cercle. Changements simples et romantiques parfaits pour les arpèges de synthétiseur et les vocodeurs. Fondement de l'Italo disco des années 1980 de Gazebo à Baltimora, combinant nostalgie avec production futuriste."
      },
      "I—iii—vi—IV": {
        "name": "I—iii—vi—IV",
        "nickname": "Italo Romantic",
        "description": "Progression Italo romantique. Descend de I par iii vers vi (tous par tierces), puis IV fournit un élan. Mouvement doux et fluide crée un caractère européen rêveur. L'accord iii ajoute de la sophistication au-delà de la pop typique. Utilisé dans les ballades Italo romantiques et les morceaux house émotionnels pour une atmosphère mélancolique et nostalgique."
      },
      "I—IV—V—iii": {
        "name": "I—IV—V—iii",
        "nickname": "Italo House",
        "description": "Progression Italo house. I-IV-V classique avec iii inattendu au lieu de retourner à I. Crée une fin surprise avant la boucle, ajoutant de l'intérêt aux grooves four-on-the-floor. L'accord iii maintient l'énergie tout en variant la résolution I attendue. Pont entre l'Italo des années 80 et la production house italienne des années 90."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Italo Pop",
        "description": "Progression Italo influencée par la pop. Commence sur le mineur relatif pour l'émotion, séquence familière vi-IV-I, se termine sur V pour une forte attraction vers le début. Crée une boucle parfaite pour la piste de danse. Cette progression est devenue omniprésente dans l'Europop des années 2000 et l'EDM, connectant la tradition Italo disco à la pop électronique moderne."
      },
      "I—V—vi—iii—IV—I": {
        "name": "I—V—vi—iii—IV—I",
        "nickname": "Extended Italo",
        "description": "Progression Italo étendue de six mesures. Séquence descendante inspirée de Pachelbel I-V-vi-iii, puis IV-I fournit la clôture. La forme plus longue permet un développement mélodique et rythmique plus élaboré. Utilisée dans les morceaux Italo disco étendus et la progressive house pour construire tension et libération sur des périodes plus longues."
      },
      "IM7—vi7—IVM7—V7": {
        "name": "IM7—vi7—IVM7—V7",
        "nickname": "Smooth Italo",
        "description": "Italo sophistiquée avec voicings jazz. I-vi-IV-V classique avec tous les accords de 7e crée un son luxuriant et doux. Les 7es majeures et mineures ajoutent une richesse harmonique au-delà des simples triades. Représente l'évolution de l'Italo vers une production plus raffinée. Utilisée dans la smooth house et le nu-disco pour un attrait sophistiqué sur la piste de danse."
      },
      "i—iv": {
        "name": "i—iv",
        "nickname": "Minimal House",
        "description": "Palette hypnotique et épurée. Accords mineurs propres avec extensions de 7e subtiles."
      }
    },
    "Synthwave/Retrowave": {
      "i—♭VII—♭VI—V": {
        "name": "i—♭VII—♭VI—V",
        "nickname": "Outrun",
        "description": "Progression synthwave outrun classique. Descend par ♭VII et ♭VI empruntés du mineur naturel, résout avec V majeur du mineur harmonique. Crée une atmosphère nostalgique des années 80 avec production moderne. La résolution V-i fournit une cadence satisfaisante. Définit le synthwave de Kavinsky à Mitch Murder pour un son rétro-futuriste."
      },
      "i—♭III—♭VII—♭VI": {
        "name": "i—♭III—♭VII—♭VI",
        "nickname": "Darkwave",
        "description": "Progression synthwave sombre. Le i mineur avec tous les accords empruntés du mineur naturel crée une atmosphère menaçante. ♭III fournit un bref espoir avant de descendre vers ♭VII et ♭VI. Évite le V majeur pour un caractère plus sombre et non résolu. Utilisé dans le darksynth et le horror synth pour des paysages sonores cyberpunk dystopiques et menaçants."
      },
      "I—V—vi—IV": {
        "name": "I—V—vi—IV",
        "nickname": "Synthpop",
        "description": "Progression synthpop moderne. L'omniprésent \"Axis of Awesome\" I-V-vi-IV réimaginé avec des synthétiseurs vintage. La tonalité majeure crée une nostalgie optimiste des années 80. Changements simples et accrocheurs parfaits pour les refrains vocaux et les mélodies de synthé. Connecte la new wave des années 80 au revival synthpop moderne et à l'électronique indie."
      },
      "i—v—♭VI—♭VII": {
        "name": "i—v—♭VI—♭VII",
        "nickname": "Cyberpunk",
        "description": "Progression synthwave cyberpunk. Le i-v mineur naturel (v mineur, pas V majeur) établit une fondation modale sombre, ♭VI et ♭VII empruntés ajoutent une couleur dystopique. Évite la résolution fonctionnelle pour une atmosphère mécanique et futuriste. Parfait pour les thèmes sci-fi, les paysages urbains néon et les productions inspirées de Blade Runner."
      },
      "I—♭VII—♭VI—I": {
        "name": "I—♭VII—♭VI—I",
        "nickname": "Dreamwave",
        "description": "Progression dreamwave avec saveur mixolydienne. I majeur avec ♭VII et ♭VI empruntés crée une atmosphère brumeuse et nostalgique, retourne à I. La tonique majeure avec accords bémol crée un caractère doux-amer. Qualité circulaire et méditative parfaite pour le synthwave ambiant et la chillwave pour des paysages sonores rétro rêveurs et éthérés."
      },
      "vi—IV—I—V": {
        "name": "vi—IV—I—V",
        "nickname": "Retrowave Pop",
        "description": "Progression retrowave influencée par la pop. Commence sur le mineur relatif pour une profondeur émotionnelle, cycle à travers des changements familiers avec production années 80. Qualité accessible à chanter ensemble connecte le synthwave à la pop mainstream. Utilisé dans le retrowave radio-friendly et le synthpop pour un attrait commercial tout en maintenant l'esthétique rétro."
      },
      "i—♭VI—III—♭VII": {
        "name": "i—♭VI—III—♭VII",
        "nickname": "Dark Synth",
        "description": "Progression dark synth agressive. Le i mineur et ♭VI emprunté du mineur naturel, III majeur du mineur harmonique crée un élan dramatique, ♭VII ajoute de la puissance. Mélange de modes crée un caractère complexe et menaçant. Utilisé dans le horror synth, la dark electro et les productions cyberpunk agressives pour une intensité et une obscurité maximales."
      },
      "IM7—iii7—vi7—IVM7": {
        "name": "IM7—iii7—vi7—IVM7",
        "nickname": "Vaporwave Dream",
        "description": "Palette nostalgique et rêveuse. Tous accords de 7e pour une esthétique smooth jazz ralentie."
      }
    },
    "African Dance": {
      "I—IV—V—IV": {
        "name": "I—IV—V—IV",
        "nickname": "Soukous Sebene",
        "description": "Progression \"sebene\" (pause instrumentale) soukous. Le I-IV-V majeur avec IV de retour crée une énergie circulaire et entraînante. Funk simple de trois accords parfait pour les lignes de guitare imbriquées complexes. L'oscillation V-IV crée un mouvement perpétuel pour danser. Fondement de la rumba congolaise et du soukous de Franco à Papa Wemba."
      },
      "I—IV—I—V": {
        "name": "I—IV—I—V",
        "nickname": "Soukous Classic",
        "description": "Progression soukous classique. I-IV établit la relation tonique-sous-dominante, retour à I confirme la maison, V crée la tension pour le cycle suivant. Changements simples et répétitifs permettent de se concentrer sur les percussions polyrythmiques et l'interaction des guitares. Fondamental à la musique de danse congolaise et est-africaine pour un groove hypnotique et festif."
      },
      "I—♭VII—IV—I": {
        "name": "I—♭VII—IV—I",
        "nickname": "Soukous Modern",
        "description": "Soukous moderne avec couleur modale. I majeur vers ♭VII emprunté crée une saveur mixolydienne, IV vers I complète la cadence plagale. Le ♭VII ajoute un côté contemporain tout en maintenant l'accessibilité pour la piste de danse. Représente l'évolution du soukous vers l'Afrobeat et la pop africaine contemporaine avec influences occidentales."
      },
      "I—IV—♭VII—I": {
        "name": "I—IV—♭VII—I",
        "nickname": "Makossa Funk",
        "description": "Progression funk makossa camerounaise. I-IV est traditionnel, ♭VII emprunté ajoute une saveur funk avant de retourner à I. Tonalité majeure avec ♭VII modal crée un caractère optimiste et dansant. Le mouvement plagal (IV et ♭VII vers I) évite la dominante, créant une qualité douce et groovy. Fondement du makossa de Manu Dibango à l'Afropop moderne."
      }
    },
    "UK Bass": {
      "i—VII—♭VI": {
        "name": "i—VII—♭VI",
        "nickname": "UK Garage",
        "description": "Palette soul et sautillante. Accords mineurs et majeurs pour des grooves 2-step sautillants."
      },
      "i—♭VI": {
        "name": "i—♭VI",
        "nickname": "Dubstep Wobble",
        "description": "Palette sombre et agressive. Mineur, diminué, dom7 pour menace et basse maximales."
      },
      "i—♭VII—i": {
        "name": "i—♭VII—i",
        "nickname": "Breakbeat",
        "description": "Palette Big Beat énergique. Mineurs et 7es dominantes pour des breaks lourds en samples."
      }
    },
    "Reggae/Dub": {
      "I—IV—I—V": {
        "name": "I—IV—I—V",
        "nickname": "Roots Dub",
        "description": "Palette roots fondamentale. Majeurs et 7es dominantes pour des entraînements de ligne de basse lourds."
      },
      "I—V—IV": {
        "name": "I—V—IV",
        "nickname": "One Drop",
        "description": "Fondation reggae classique. Triades majeures et dom7, pas de mineur pour une sensation authentique."
      },
      "i—♭VII—♭VI": {
        "name": "i—♭VII—♭VI",
        "nickname": "Steppers Dub",
        "description": "Palette profonde et méditative. Mélange mineur et majeur pour des sessions dub steppers 4/4."
      }
    },
    "Acid/EBM": {
      "i—iv—♭VII—i": {
        "name": "i—iv—♭VII—i",
        "nickname": "EBM Classic",
        "description": "Palette sombre et tendue. Mineur, diminué, dom7 pour la musique industrielle corporelle."
      },
      "i—♭VII—iv": {
        "name": "i—♭VII—iv",
        "nickname": "Acid 303",
        "description": "Palette acid classique. 7es mineures et voicings quartaux pour le squelch TB-303."
      }
    }
  }
}
